Repository: osmandemiroz/astro-iztro
Catalog: lib/l10n/app_*.arb
Languages: ja, tr, zh

# fireEnergyPassion
source: Fire - Energy, passion, enthusiasm
ja: 火 - エネルギー、情熱、熱意
tr: Ateş - Enerji, tutku, coşku
zh: 火 - 能量、激情、热情

# earthStabilityReliability
source: Earth - Stability, reliability, grounding
ja: 土 - 安定性、信頼性、グラウンディング
tr: Toprak - Kararlılık, güvenilirlik, topraklama
zh: 土 - 稳定性、可靠性、接地

# metalPrecisionDetermination
source: Metal - Precision, determination, structure
ja: 金 - 精密さ、決意、構造
tr: Metal - Hassasiyet, kararlılık, yapı
zh: 金 - 精确、决心、结构

# waterWisdomAdaptability
source: Water - Wisdom, adaptability, intuition
ja: 水 - 知恵、適応性、直感
tr: Su - Bilgelik, uyum sağlama, sezgi
zh: 水 - 智慧、适应性、直觉

source: Unknown element
ja: 未知の五行
tr: Bilinmeyen element
zh: 未知五行

source: No Profile
ja: プロフィールなし
tr: Profil Yok
zh: 无档案

source: Please create a profile first
ja: まずプロフィールを作成してください
tr: Lütfen önce bir profil oluşturun
zh: 请先创建档案

source: Success
ja: 成功
tr: Başarılı
zh: 成功

source: BaZi calculated successfully!
ja: 八字が正常に計算されました！
tr: BaZi başarıyla hesaplandı!
zh: 八字计算成功！

source: Calculation Error
ja: 計算エラー
tr: Hesaplama Hatası
zh: 计算错误

# failedToCalculateBaZi
source: Failed to calculate BaZi: {error}
ja: 八字の計算に失敗しました: {error}
tr: BaZi hesaplanamadı: {error}
zh: 计算八字失败: {error}

source: Error
ja: エラー
tr: Hata
zh: 错误

# failedToLoadBaZiData
source: Failed to load BaZi data: {error}
ja: 八字データの読み込みに失敗しました: {error}
tr: BaZi verisi yüklenemedi: {error}
zh: 加载八字数据失败: {error}

source: No BaZi Data
ja: 八字データなし
tr: BaZi Verisi Yok
zh: 无八字数据

source: Please calculate BaZi first
ja: まず八字を計算してください
tr: Lütfen önce BaZi hesaplayın
zh: 请先计算八字

source: Export
ja: エクスポート
tr: Dışa Aktar
zh: 导出

source: BaZi export feature coming soon!
ja: 八字エクスポート機能がまもなく登場します！
tr: BaZi dışa aktarma özelliği yakında geliyor!
zh: 八字导出功能即将推出！

source: Export Error
ja: エクスポートエラー
tr: Dışa Aktarma Hatası
zh: 导出错误

# failedToExportBaZi
source: Failed to export BaZi: {error}
ja: 八字のエクスポートに失敗しました: {error}
tr: BaZi dışa aktarılamadı: {error}
zh: 导出八字失败: {error}

# tarotReadingTitle
source: TAROT READING
ja: タロットリーディング
tr: TAROT OKUMASI
zh: 塔罗牌阅读

# tarotReadingSubtitle
source: Discover your path through mystical wisdom
ja: カードから導きを求める
tr: Mistik bilgelik aracılığıyla yolunuzu keşfedin
zh: 从卡牌中寻求指引

source: Choose Reading Type
ja: リーディングタイプを選択
tr: Okuma Türünü Seçin
zh: 选择阅读类型

source: Single Card
ja: ワンカード
tr: Tek Kart
zh: 单张牌

source: Quick insight
ja: クイックインサイト
tr: Hızlı içgörü
zh: 快速洞察

source: Three Card
ja: スリーカード
tr: Üç Kart
zh: 三张牌

source: Past, Present, Future
ja: 過去・現在・未来
tr: Geçmiş, Şimdi, Gelecek
zh: 过去·现在·未来

source: Celtic Cross
ja: ケルト十字
tr: Kelt Haçı
zh: 凯尔特十字

source: Comprehensive reading
ja: 包括的リーディング
tr: Kapsamlı okuma
zh: 全面阅读

source: Horseshoe
ja: ホースシュー
tr: Nal
zh: 马蹄形

source: Timing & progression
ja: タイミング・進行
tr: Zamanlama ve ilerleme
zh: 时机·进展

source: Daily Draw
ja: デイリードロー
tr: Günlük Çekim
zh: 每日抽牌

source: Daily guidance
ja: 日々のガイダンス
tr: Günlük rehberlik
zh: 每日指引

# genericTarotReading
source: Tarot reading
ja: 一般的なタロットリーディング
tr: Tarot okuması
zh: 通用塔罗牌阅读

source: Available Cards
ja: 利用可能なカード
tr: Mevcut Kartlar
zh: 可用卡牌

# cardsSelected
source: {count} selected
ja: 選択されたカード
tr: {count} seçildi
zh: 已选择卡牌

source: Major Arcana
ja: 大アルカナ
tr: Büyük Arkana
zh: 大阿卡纳

source: Minor Arcana
ja: 小アルカナ
tr: Küçük Arkana
zh: 小阿卡纳

source: Show Less
ja: 少なく表示
tr: Daha Az Göster
zh: 显示更少

source: Show More
ja: もっと表示
tr: Daha Fazla Göster
zh: 显示更多

source: Unknown Card
ja: 不明なカード
tr: Bilinmeyen Kart
zh: 未知卡牌

source: Your Question
ja: あなたの質問
tr: Sorunuz
zh: 您的问题

# askCardsForGuidance
source: Ask the cards for guidance...
ja: ガイダンスのためにカードに尋ねる
tr: Rehberlik için kartlara sorun...
zh: 向卡牌寻求指引

source: Reading Cards...
ja: カードを読む
tr: Kartlar Okunuyor...
zh: 阅读卡牌

source: Perform Reading
ja: リーディングを実行
tr: Okuma Yap
zh: 执行阅读

source: Selected Cards
ja: 選択されたカード
tr: Seçilen Kartlar
zh: 已选择卡牌

source: New Reading
ja: 新しいリーディング
tr: Yeni Okuma
zh: 新阅读

# cardPosition
source: **Card {position}: {cardName}**
ja: **カード{position}: {cardName}**
tr: **Kart {position}: {cardName}**
zh: **第{position}张牌: {cardName}**

source: Reversed
ja: 逆位置
tr: Ters
zh: 逆位

source: Upright
ja: 正位置
tr: Düz
zh: 正位

source: Loading...
ja: 読み込み中
tr: Yükleniyor...
zh: 加载中

source: Reading Interpretation
ja: リーディング解釈
tr: Okuma Yorumu
zh: 阅读解读

# singleCardReadingDescription
source: **Single Card Reading** - A focused insight into your question
ja: **単一カードリーディング** - あなたの質問への焦点を当てた洞察
tr: **Tek Kart Okuması** - Sorunuzla ilgili odaklanmış bir içgörü
zh: **单张塔罗牌解读** - 针对您问题的专注洞察

# threeCardReadingDescription
source: **Three Card Reading** - Past, Present, and Future perspectives on your situation
ja: **3枚カードリーディング** - あなたの状況の過去、現在、未来の視点
tr: **Üç Kart Okuması** - Durumunuzla ilgili Geçmiş, Şimdi ve Gelecek perspektifleri
zh: **三张塔罗牌解读** - 您情况的过去、现在、未来视角

# celticCrossReadingDescription
source: **Celtic Cross Reading** - A comprehensive exploration of your question with deep insights
ja: **ケルト十字リーディング** - 深い洞察であなたの質問の包括的な探求
tr: **Kelt Haçı Okuması** - Derin içgörülerle sorunuzun kapsamlı bir keşfi
zh: **凯尔特十字解读** - 深入洞察您问题的全面探索

# horseshoeReadingDescription
source: **Horseshoe Reading** - Guidance on timing and progression of events
ja: **ホースシューリーディング** - タイミングと出来事の進行に関するガイダンス
tr: **Nal Okuması** - Zamanlama ve olayların ilerlemesi konusunda rehberlik
zh: **马蹄形解读** - 关于时机和事件进展的指导

# dailyDrawReadingDescription
source: **Daily Draw** - Today's guidance and reflection for your journey
ja: **デイリードロー** - あなたの旅のための今日のガイダンスと反省
tr: **Günlük Çekim** - Yolculuğunuz için bugünün rehberliği ve düşünümü
zh: **每日抽牌** - 为您旅程提供的今日指导和反思

# genericTarotReadingDescription
source: **Tarot Reading** - Divine guidance and insight for your question
ja: **タロットリーディング** - あなたの質問への神聖なガイダンスと洞察
tr: **Tarot Okuması** - Sorunuz için ilahi rehberlik ve içgörü
zh: **塔罗牌解读** - 为您问题提供的神圣指导和洞察

source: Question Required
ja: 質問が必要です
tr: Soru Gerekli
zh: 需要问题

# pleaseEnterQuestionForReading
source: Please enter a question for your reading
ja: リーディングのための質問を入力してください
tr: Lütfen okumanız için bir soru girin
zh: 请输入阅读问题

source: Reading Error
ja: リーディングエラー
tr: Okuma Hatası
zh: 阅读错误

# failedToCompleteReading
source: Failed to complete reading: {error}
ja: リーディングの完了に失敗しました
tr: Okuma tamamlanamadı: {error}
zh: 完成阅读失败

# failedToLoadTarotCards
source: Failed to load tarot cards: {error}
ja: タロットカードの読み込みに失敗しました
tr: Tarot kartları yüklenemedi: {error}
zh: 加载塔罗牌失败

# errorLoadingTarotCards
source: Error
ja: タロットカードの読み込みエラー
tr: Hata
zh: 加载塔罗牌错误

# questionLabel
source: Question: {question}
ja: 質問
tr: Soru: {question}
zh: 问题

# cardPositionLabel
source: Card {position}: {cardName}
ja: カード位置
tr: Kart {position}: {cardName}
zh: 卡牌位置

# orientationLabel
source: Orientation: {orientation}
ja: 向き
tr: Yönelim: {orientation}
zh: 方向

# meaningLabel
source: Meaning: {meaning}
ja: 意味
tr: Anlam: {meaning}
zh: 含义

# descriptionLabel
source: Description: {description}
ja: 説明
tr: Açıklama: {description}
zh: 描述

source: Overall Interpretation:
ja: 全体的な解釈
tr: Genel Yorum:
zh: 整体解读

source: No reversed meaning available
ja: 逆位置の意味は利用できません
tr: Ters anlam mevcut değil
zh: 无逆位含义可用

source: No upright meaning available
ja: 正位置の意味は利用できません
tr: Düz anlam mevcut değil
zh: 无正位含义可用

source: No description available
ja: 説明は利用できません
tr: Açıklama mevcut değil
zh: 无可用描述

source: **Actionable Guidance:**
ja: 実行可能なガイダンス
tr: **Eylem Odaklı Rehberlik:**
zh: 可操作的指导

source: **Affirmations:**
ja: アファメーション
tr: **Olumlamalar:**
zh: 肯定语

source: **Considerations:**
ja: 考慮事項
tr: **Dikkat Edilmesi Gerekenler:**
zh: 考虑事项

source: Focus areas
ja: 焦点領域
tr: Odak alanları
zh: 关注领域

source: **Timing Insights:**
ja: タイミング洞察
tr: **Zamanlama İçgörüleri:**
zh: 时机洞察

source: **Best Times for Action:**
ja: 行動の最適な時間
tr: **Eylem İçin En İyi Zamanlar:**
zh: 行动的最佳时机

source: Enhanced Tarot Reading
ja: 強化されたタロットリーディング
tr: Gelişmiş Tarot Okuması
zh: 增强塔罗牌阅读

source: No question provided
ja: 質問が提供されていません
tr: Soru sağlanmadı
zh: 未提供问题

# singleCardReadingFull
source: Single Card Reading
ja: ワンカードリーディング
tr: Tek Kart Okuması
zh: 单张牌阅读

# threeCardReadingFull
source: Three Card Reading (Past, Present, Future)
ja: スリーカードリーディング
tr: Üç Kart Okuması (Geçmiş, Şimdi, Gelecek)
zh: 三张牌阅读

# celticCrossReadingFull
source: Celtic Cross Reading
ja: ケルト十字リーディング
tr: Kelt Haçı Okuması
zh: 凯尔特十字阅读

# horseshoeReadingFull
source: Horseshoe Reading
ja: ホースシューリーディング
tr: Nal Okuması
zh: 马蹄形阅读

# dailyDrawReadingFull
source: Daily Draw
ja: デイリードローリーディング
tr: Günlük Çekim
zh: 每日抽牌阅读

# comprehensiveExplorationDescription
source: "{readingType}" - A comprehensive exploration of your question with deep insights
ja: 包括的な探求の説明
tr: "{readingType}" - Sorunuzla ilgili derin içgörülerle kapsamlı bir keşif
zh: 全面探索描述

# yourQuestionAbout
source: Your question about {question} reveals important insights.
ja: あなたの質問について
tr: {question} hakkındaki sorunuz önemli içgörüler ortaya çıkarıyor.
zh: 您的问题关于

source: No cards selected
ja: カードが選択されていません
tr: Kart seçilmedi
zh: 未选择卡牌

# cardNumber
source: Card {number}: {cardName}
ja: カード番号
tr: Kart {number}: {cardName}
zh: 卡牌编号

source: challenges or blockages
ja: 挑戦またはブロック
tr: zorluklar veya engeller
zh: 挑战或阻碍

source: opportunities and positive energy
ja: 機会とポジティブエネルギー
tr: fırsatlar ve pozitif enerji
zh: 机会和正能量

# thisCardSuggests
source: This card suggests {suggestion} in relation to your question about {question}.
ja: このカードは示唆します
tr: Bu kart, {question} hakkındaki sorunuzla ilgili olarak {suggestion} önerir.
zh: 这张牌建议

# meaningLabelShort
source: Meaning:
ja: 意味
tr: Anlam:
zh: 含义

source: In your situation:
ja: あなたの状況において
tr: Durumunuzda:
zh: 在您的情况下

source: Actions
ja: 行動
tr: Eylemler
zh: 行动

source: Timeframes
ja: 時間枠
tr: Zaman Çerçeveleri
zh: 时间框架

source: Best Times
ja: 最適な時間
tr: En İyi Zamanlar
zh: 最佳时机

source: Patterns
ja: パターン
tr: Desenler
zh: 模式

source: love and relationships
ja: 愛と関係
tr: aşk ve ilişkiler
zh: 爱情和关系

source: career and professional life
ja: キャリアと職業生活
tr: kariyer ve profesyonel yaşam
zh: 职业和事业生活

source: financial matters and abundance
ja: 財務事項と豊かさ
tr: mali konular ve bolluk
zh: 财务事项和丰盛

source: health and wellness
ja: 健康とウェルネス
tr: sağlık ve esenlik
zh: 健康和福祉

source: spiritual growth and purpose
ja: スピリチュアル成長と目的
tr: ruhsal büyüme ve amaç
zh: 精神成长和目标

source: family and home life
ja: 家族と家庭生活
tr: aile ve ev yaşamı
zh: 家庭和居家生活

source: travel and new experiences
ja: 旅行と新しい体験
tr: seyahat ve yeni deneyimler
zh: 旅行和新体验

source: important decisions and choices
ja: 重要な決定と選択
tr: önemli kararlar ve seçimler
zh: 重要决定和选择

source: timing and life cycles
ja: タイミングと人生のサイクル
tr: zamanlama ve yaşam döngüleri
zh: 时机和人生周期

source: your life path
ja: あなたの人生の道
tr: yaşam yolunuz
zh: 您的人生道路

source: **Overall Message:**
ja: **全体的なメッセージ:**
tr: **Genel Mesaj:**
zh: **总体信息:**

source: Timing
ja: タイミング
tr: Zamanlama
zh: **时机:**

# inYourSituationContext
source: In your situation: {contextualMeaning}
ja: あなたの状況では: {contextualMeaning}
tr: Durumunuzda: {contextualMeaning}
zh: 在您的情况下: {contextualMeaning}

# significantTransformationPast
source: This represents a significant transformation or ending that has shaped your current situation.
ja: これは、あなたの現在の状況を形作った重要な変容または終了を表しています。
tr: Bu, mevcut durumunuzu şekillendiren önemli bir dönüşümü veya sonu temsil eder.
zh: 这代表了一个重要的转变或结束，塑造了您当前的情况。

# newBeginningPast
source: This reflects a new beginning or skill development that started your journey.
ja: これは、あなたの旅を始めた新しい始まりやスキル開発を反映しています。
tr: Bu, yolculuğunuzu başlatan yeni bir başlangıcı veya beceri gelişimini yansıtır.
zh: 这反映了开始您旅程的新开始或技能发展。

# pastInfluencesGeneral
source: This card represents past influences that are still affecting your current circumstances.
ja: このカードは、あなたの現在の状況にまだ影響を与えている過去の影響を表しています。
tr: Bu kart, hala mevcut koşullarınızı etkileyen geçmiş etkileri temsil eder.
zh: 这张牌代表仍在影响您当前情况的过去影响。

# introspectionPresent
source: You are currently in a period of introspection and inner wisdom. Trust your intuition.
ja: あなたは現在、内省と内なる知恵の期間にあります。直感を信じてください。
tr: Şu anda içe bakış ve iç bilgelik dönemindesiniz. Sezgilerinize güvenin.
zh: 您目前正处于内省和内在智慧的时期。相信您的直觉。

# activeWorkPresent
source: You are actively working towards your goals with determination and control.
ja: あなたは決意とコントロールを持って目標に向かって積極的に取り組んでいます。
tr: Hedeflerinize doğru kararlılık ve kontrolle aktif olarak çalışıyorsunuz.
zh: 您正在以决心和控制力积极地朝着目标努力。

# currentSituationGeneral
source: This card represents your current situation and the energy you are working with.
ja: このカードは、あなたの現在の状況とあなたが働いているエネルギーを表しています。
tr: Bu kart, mevcut durumunuzu ve birlikte çalıştığınız enerjiyi temsil eder.
zh: 这张牌代表您当前的情况和您正在处理的能量。

# brightOutcomeFuture
source: A bright and positive outcome awaits you if you continue on your current path.
ja: 現在の道を続けるなら、明るくポジティブな結果があなたを待っています。
tr: Mevcut yolunuzda devam ederseniz, parlak ve pozitif bir sonuç sizi bekliyor.
zh: 如果您继续当前的道路，光明和积极的结果等待着您。

# potentialChallengesFuture
source: Be aware of potential challenges or illusions that may arise.
ja: 潜在的な挑戦や幻想が生じる可能性があることに注意してください。
tr: Ortaya çıkabilecek potansiyel zorluklar veya yanılsamalara dikkat edin.
zh: 注意可能出现的潜在挑战或幻觉。

# pathDirectionFuture
source: This card shows the direction your path is taking and what you can expect.
ja: このカードは、あなたの道が向かっている方向と何を期待できるかを示しています。
tr: Bu kart, yolunuzun aldığı yönü ve ne bekleyebileceğinizi gösterir.
zh: 这张牌显示您道路的方向和您可以期待什么。

# relationshipDecisionLove
source: This represents a significant relationship decision or partnership opportunity.
ja: これは重要な関係の決定やパートナーシップの機会を表しています。
tr: Bu, önemli bir ilişki kararını veya ortaklık fırsatını temsil eder.
zh: 这代表一个重要的关系决定或合作机会。

# romanticConnectionLove
source: A new romantic connection or deepening of existing love is indicated.
ja: 新しいロマンチックなつながりや既存の愛の深化が示されています。
tr: Yeni romantik bir bağlantı veya mevcut aşkın derinleşmesi belirtiliyor.
zh: 表示新的浪漫联系或现有爱情的深化。

# skillsManifestCareer
source: You have the skills and resources to manifest your career goals.
ja: あなたはキャリアの目標を実現するためのスキルとリソースを持っています。
tr: Kariyer hedeflerinizi gerçekleştirmek için gerekli beceri ve kaynaklara sahipsiniz.
zh: 您拥有实现职业目标所需的技能和资源。

# determinationSuccessCareer
source: Your determination and focus will lead to career success.
ja: あなたの決意と集中力がキャリアの成功につながるでしょう。
tr: Kararlılığınız ve odaklanmanız kariyer başarısına yol açacak.
zh: 您的决心和专注将带来职业成功。

# financialBalanceFinance
source: Financial balance and generosity are key themes in your situation.
ja: 財務のバランスと寛大さがあなたの状況の主要なテーマです。
tr: Mali denge ve cömertlik durumunuzda ana temalardır.
zh: 财务平衡和慷慨是您情况的关键主题。

# longTermSecurityFinance
source: Long-term financial security and family wealth are indicated.
ja: 長期的な財務の安定と家族の富が示されています。
tr: Uzun vadeli mali güvenlik ve aile zenginliği belirtiliyor.
zh: 表示长期财务安全和家庭财富。

# cardEnergyRelevant
source: This card's energy is particularly relevant to your {categoryDescription}.
ja: このカードのエネルギーは特にあなたの{categoryDescription}に関連しています。
tr: Bu kartın enerjisi özellikle {categoryDescription} ile ilgilidir.
zh: 这张牌的能量特别与您的{categoryDescription}相关。

# positiveEnergyLove
source: The cards show positive energy in your love life. Trust the process and remain open to love.
ja: カードはあなたの恋愛生活にポジティブなエネルギーを示しています。プロセスを信じて愛に心を開いてください。
tr: Kartlar aşk hayatınızda pozitif enerji gösteriyor. Sürece güvenin ve aşka açık kalın.
zh: 牌显示您爱情生活中的积极能量。相信过程并保持对爱的开放。

# careerPathAligned
source: Your career path is well-aligned with positive outcomes. Continue with confidence and determination.
ja: あなたのキャリアパスはポジティブな結果と良く一致しています。自信と決意を持って続けてください。
tr: Kariyer yolunuz pozitif sonuçlarla iyi hizalanmış. Güven ve kararlılıkla devam edin.
zh: 您的职业道路与积极结果很好地对齐。以信心和决心继续前进。

# financialAbundancePositive
source: Financial abundance and prosperity are indicated. Your efforts will be rewarded.
ja: 財務の豊かさと繁栄が示されています。あなたの努力は報われるでしょう。
tr: Mali bolluk ve refah belirtiliyor. Çabalarınız ödüllendirilecek.
zh: 表示财务丰盛和繁荣。您的努力将得到回报。

# overallPositiveEnergy
source: The overall energy is positive and supportive. Trust your path and embrace the opportunities ahead.
ja: 全体的なエネルギーはポジティブで支援的です。あなたの道を信じて、前にある機会を受け入れてください。
tr: Genel enerji pozitif ve destekleyici. Yolunuza güvenin ve önünüzdeki fırsatları kucaklayın.
zh: 整体能量是积极和支持性的。相信您的道路并拥抱前方的机会。

# relationshipChallenges
source: The cards suggest challenges in relationships. This is a time for self-reflection and healing.
ja: カードは関係における挑戦を示唆しています。これは自己反省と癒しの時です。
tr: Kartlar ilişkilerde zorluklar öneriyor. Bu öz-düşünüm ve iyileşme zamanı.
zh: 牌暗示关系中的挑战。这是自我反思和治愈的时候。

# careerObstacles
source: Career obstacles may arise, but these are opportunities for growth and learning.
ja: キャリアの障害が生じる可能性がありますが、これらは成長と学習の機会です。
tr: Kariyer engelleri ortaya çıkabilir, ancak bunlar büyüme ve öğrenme fırsatlarıdır.
zh: 职业障碍可能出现，但这些都是成长和学习的机会。

# financialChallenges
source: Financial challenges may be present, but they are temporary. Focus on stability and planning.
ja: 財務の挑戦が存在する可能性がありますが、これらは一時的です。安定性と計画に焦点を当ててください。
tr: Mali zorluklar mevcut olabilir, ancak bunlar geçicidir. İstikrar ve planlamaya odaklanın.
zh: 财务挑战可能存在，但它们是暂时的。专注于稳定和规划。

# challengesLeadGrowth
source: While challenges are indicated, remember that difficulties often lead to growth and transformation.
ja: 挑戦が示されている一方で、困難はしばしば成長と変容につながることを忘れないでください。
tr: Zorluklar belirtilse de, güçlüklerin genellikle büyüme ve dönüşüme yol açtığını unutmayın.
zh: 虽然表明有挑战，但请记住困难往往导致成长和转变。

# loveLifeBalance
source: Your love life shows balance between giving and receiving. Maintain harmony in relationships.
ja: あなたの恋愛生活は与えることと受け取ることの間にバランスを示しています。関係で調和を保ってください。
tr: Aşk hayatınız verme ve alma arasında denge gösteriyor. İlişkilerde uyumu koruyun.
zh: 您的爱情生活在给予和接受之间显示平衡。在关系中保持和谐。

# careerSteadyProgress
source: Your career path shows steady progress. Balance work with personal growth.
ja: あなたのキャリアパスは着実な進歩を示しています。仕事と個人的成長のバランスを取ってください。
tr: Kariyer yolunuz istikrarlı ilerleme gösteriyor. İşi kişisel büyümeyle dengeleyin.
zh: 您的职业道路显示稳步进展。平衡工作与个人成长。

# financialStability
source: Financial stability is indicated. Balance spending with saving for long-term security.
ja: 財務の安定が示されています。長期的な安全のために支出と貯蓄のバランスを取ってください。
tr: Mali istikrar belirtiliyor. Uzun vadeli güvenlik için harcamayı tasarrufla dengeleyin.
zh: 表示财务稳定。平衡支出与储蓄以实现长期安全。

# balancedEnergy
source: The cards show a balanced energy. This is a time of stability and steady progress.
ja: カードはバランスの取れたエネルギーを示しています。これは安定性と着実な進歩の時です。
tr: Kartlar dengeli bir enerji gösteriyor. Bu istikrar ve istikrarlı ilerleme zamanı.
zh: 牌显示平衡的能量。这是稳定和稳步进展的时候。

# timingNotAvailable
source: Timing information is not available.
ja: タイミング情報は利用できません。
tr: Zamanlama bilgisi mevcut değil.
zh: 时机信息不可用。

# changesComeSoon
source: The cards indicate that changes or answers will come soon. Stay alert and prepared.
ja: カードは変化や答えが間もなく来ることを示しています。警戒し、準備してください。
tr: Kartlar değişikliklerin veya cevapların yakında geleceğini gösteriyor. Dikkatli olun ve hazırlıklı olun.
zh: 牌表明变化或答案很快就会到来。保持警觉并做好准备。

# patienceRequired
source: Patience is required
ja: 忍耐が必要です
tr: Sabır gereklidir
zh: 需要耐心

# longTermSituation
source: This is a long-term situation that will develop gradually. Focus on steady progress.
ja: これは徐々に発展する長期的な状況です。着実な進歩に焦点を当ててください。
tr: Bu kademeli olarak gelişecek uzun vadeli bir durumdur. İstikrarlı ilerlemeye odaklanın.
zh: 这是一个将逐渐发展的长期情况。专注于稳步进展。

# positiveOutcomesWeeksMonths
source: Positive outcomes are likely to manifest within the next few weeks to months.
ja: ポジティブな結果は今後数週間から数ヶ月以内に現れる可能性があります。
tr: Pozitif sonuçların önümüzdeki birkaç hafta ile ay içinde gerçekleşmesi muhtemel.
zh: 积极结果可能在接下来的几周到几个月内显现。

# challengesAriseSoon
source: Challenges may arise soon, but they will pass. Focus on growth and learning.
ja: 挑戦が間もなく生じる可能性がありますが、それらは通り過ぎるでしょう。成長と学習に焦点を当ててください。
tr: Zorluklar yakında ortaya çıkabilir, ancak geçecekler. Büyüme ve öğrenmeye odaklanın.
zh: 挑战可能很快出现，但它们会过去。专注于成长和学习。

# steadyProgressMonths
source: The timing suggests steady progress over the coming months.
ja: タイミングは今後数ヶ月にわたる着実な進歩を示唆しています。
tr: Zamanlama gelecek aylarda istikrarlı ilerleme öneriyor.
zh: 时机表明在未来几个月内稳步进展。

# openHeartNewPossibilities
source: Open your heart to new possibilities
ja: 新しい可能性に心を開いてください
tr: Yeni olanaklara kalbinizi açın
zh: 向新的可能性敞开心扉

# expressFeelingsAuthentically
source: Express your feelings authentically
ja: 感情を真摯に表現してください
tr: Duygularınızı samimi bir şekilde ifade edin
zh: 真诚地表达您的感受

# worthyOfLoveAndRespect
source: I am worthy of love and respect
ja: 私は愛と尊敬に値します
tr: Sevgi ve saygıya layığım
zh: 我值得被爱和尊重

# focusSelfLoveHealing
source: Focus on self-love and healing
ja: セルフラブと癒しに焦点を当ててください
tr: Öz-sevgi ve iyileşmeye odaklanın
zh: 专注于自爱和治愈

# communicateOpenlyConcerns
source: Communicate openly about concerns
ja: 懸念についてオープンにコミュニケーションを取ってください
tr: Endişeleriniz hakkında açık iletişim kurun
zh: 开放地沟通您的担忧

# avoidRushingRelationships
source: Avoid rushing into new relationships
ja: 新しい関係に急がないでください
tr: Yeni ilişkilere acele etmekten kaçının
zh: 避免急于建立新关系

# maintainBalanceGivingReceiving
source: Maintain balance in giving and receiving
ja: 与えることと受け取ることのバランスを保ってください
tr: Verme ve alma konusunda dengeyi koruyun
zh: 在给予和接受之间保持平衡

# practicePatienceRelationships
source: Practice patience in relationships
ja: 関係において忍耐を実践してください
tr: İlişkilerde sabır pratiği yapın
zh: 在关系中练习耐心

# takeConfidentActionGoals
source: Take confident action towards your goals
ja: 目標に向かって自信を持って行動してください
tr: Hedeflerinize doğru güvenli adımlar atın
zh: 自信地朝着目标行动

# networkBuildRelationships
source: Network and build professional relationships
ja: ネットワーキングをし、専門的な関係を築いてください
tr: Ağ kurun ve profesyonel ilişkiler geliştirin
zh: 建立网络并发展专业关系

# skillsToSucceed
source: I have the skills to succeed
ja: 成功するために必要なスキルを持っています
tr: Başarılı olmak için gerekli becerilere sahibim
zh: 我拥有成功所需的技能

# addressSkillGapsObstacles
source: Address any skill gaps or obstacles
ja: スキルギャップや障害に対処してください
tr: Beceri eksikliklerini veya engelleri ele alın
zh: 解决技能差距或障碍

# seekMentorshipGuidance
source: Seek mentorship or guidance
ja: メンターシップや指導を求めてください
tr: Mentörlük veya rehberlik arayın
zh: 寻求指导或建议

# avoidHastyCareerDecisions
source: Avoid making hasty career decisions
ja: 急いだキャリアの決定を避けてください
tr: Acele kariyer kararları almaktan kaçının
zh: 避免匆忙的职业决定

# focusSteadyProgress
source: Focus on steady, consistent progress
ja: 着実で安定した進歩に焦点を当ててください
tr: Sürekli, istikrarlı ilerlemeye odaklanın
zh: 专注于稳定持续的进步

# balanceWorkPersonalDevelopment
source: Balance work with personal development
ja: 仕事と個人的な発展のバランスを取ってください
tr: İş ile kişisel gelişimi dengeleyin
zh: 平衡工作与个人发展

# investFutureWisely
source: Invest in your future wisely
ja: 将来に賢く投資してください
tr: Geleceğinize akıllıca yatırım yapın
zh: 明智地为未来投资

# shareAbundanceOthers
source: Share your abundance with others
ja: 豊かさを他の人と分かち合ってください
tr: Bolluğunuzu başkalarıyla paylaşın
zh: 与他人分享您的丰盛

# attractFinancialProsperity
source: I attract financial prosperity
ja: 財政的な繁栄を引き寄せています
tr: Mali refahı çekiyorum
zh: 我正在吸引财务繁荣

# createBudgetFinancialPlan
source: Create a budget and financial plan
ja: 予算と財務計画を作成してください
tr: Bir bütçe ve finansal plan oluşturun
zh: 制定预算和财务计划

source: Avoid unnecessary expenses
ja: 不要な支出を避けてください
tr: Gereksiz harcamalardan kaçının
zh: 避免不必要的支出

# cautiousFinancialDecisions
source: Be cautious with financial decisions
ja: 財務上の決定に注意深くしてください
tr: Finansal kararlarda dikkatli olun
zh: 在财务决定上谨慎

source: Maintain financial discipline
ja: 財務規律を維持してください
tr: Mali disiplini koruyun
zh: 保持财务纪律

# buildLongTermSecurity
source: Build long-term financial security
ja: 長期的な財政的セキュリティを築いてください
tr: Uzun vadeli mali güvenlik oluşturun
zh: 建立长期财务安全

# embracePositiveEnergy
source: Embrace the positive energy around you
ja: 周りのポジティブなエネルギーを受け入れてください
tr: Çevrenizdeki pozitif enerjiyi kucaklayın
zh: 拥抱周围的积极能量

# takeActionGoals
source: Take action on your goals
ja: 目標のために行動を起こしてください
tr: Hedefleriniz için harekete geçin
zh: 为您的目标采取行动

# capableAndConfident
source: I am capable and confident
ja: 有能で自信を持っています
tr: Yetenekli ve kendime güveniyorum
zh: 我有能力且自信
