Repository: osmandemiroz/astro-iztro
Catalog: lib/l10n/app_*.arb
Languages: ja, tr, zh

# welcomeTitle
source: Welcome to Astro Iztro
ja: Astro Iztroへようこそ
tr: Astro Iztro'ya Hoş Geldiniz
zh: 欢迎来到 Astro Iztro

# welcomeSubtitle
source: Discover the ancient wisdom of Purple Star Astrology through modern technology
ja: 現代技術を通じて紫微斗数の古代の知恵を発見してください
tr: Modern teknoloji aracılığıyla Mor Yıldız Astrolojisinin kadim bilgeliğini keşfedin
zh: 通过现代技术探索紫微斗数的古老智慧

source: Skip
ja: スキップ
tr: Atla
zh: 跳过

source: Next
ja: 次へ
tr: İleri
zh: 下一步

source: Previous
ja: 前へ
tr: Geri
zh: 上一步

source: Get Started
ja: 始める
tr: Başlayalım
zh: 开始使用

source: Powerful Features
ja: 強力な機能
tr: Güçlü Özellikler
zh: 强大功能

# purpleStarCharts
source: Purple Star Astrology Charts
ja: 紫微斗数チャート
tr: Mor Yıldız Astroloji Haritaları
zh: 紫微斗数星盘

source: BaZi Analysis
ja: 八字分析
tr: BaZi Analizi
zh: 八字分析

source: Compatibility Matching
ja: 相性マッチング
tr: Uyumluluk Eşleştirmesi
zh: 配对匹配

# tarotReadings
source: Tarot Card Readings
ja: タロットカードリーディング
tr: Tarot Kartı Okumaları
zh: 塔罗牌占卜

source: Analysis
ja: 分析
tr: Analiz
zh: 分析

source: Compatibility
ja: 相性
tr: Uyumluluk
zh: 配对

# ancientWisdomTitle
source: Ancient Wisdom, Modern Insight
ja: 古代の知恵、現代の洞察
tr: Kadim Bilgelik, Modern İçgörü
zh: 古老智慧，现代洞察

# ancientWisdomSubtitle
source: Explore your destiny through Purple Star Astrology, BaZi analysis, and Tarot readings
ja: 紫微斗数、八字分析、タロットリーディングを通じてあなたの運命を探求してください
tr: Mor Yıldız Astrolojisi, BaZi analizi ve Tarot okumaları aracılığıyla kaderinizi keşfedin
zh: 通过紫微斗数、八字分析和塔罗占卜探索您的命运

source: Ready to Begin?
ja: 始める準備はできましたか？
tr: Başlamaya Hazır mısınız?
zh: 准备开始了吗？

# readyToBeginSubtitle
source: Start your journey into the mystical world of astrology and discover what the stars have in store for you
ja: 占星術の神秘的な世界への旅を始め、星があなたのために用意したものを発見してください
tr: Astrolojinin mistik dünyasına yolculuğunuza başlayın ve yıldızların sizin için ne hazırladığını keşfedin
zh: 开始您的占星学神秘世界之旅，发现星星为您准备的惊喜

# loadingCosmicJourney
source: Loading your cosmic journey...
ja: あなたの宇宙の旅を読み込み中...
tr: Kozmik yolculuğunuz yükleniyor...
zh: 正在加载您的宇宙之旅...

# welcomeBack
source: Welcome back, {name}!
ja: おかえりなさい、{name}さん！
tr: Tekrar hoş geldin, {name}!
zh: 欢迎回来，{name}！

source: Welcome to Astro Iztro!
ja: Astro Iztroへようこそ！
tr: Astro Iztro'ya Hoş Geldiniz!
zh: 欢迎来到 Astro Iztro！

# discoverCosmicDestiny
source: Discover your cosmic destiny
ja: あなたの宇宙の運命を発見してください
tr: Kozmik kaderinizi keşfedin
zh: 发现您的宇宙命运

source: Dashboard
ja: ダッシュボード
tr: Kontrol Paneli
zh: 仪表板

source: Current Profile
ja: 現在のプロフィール
tr: Mevcut Profil
zh: 当前档案

source: Create Your First Profile
ja: 最初のプロフィールを作成
tr: İlk Profilinizi Oluşturun
zh: 创建您的第一个档案

# startAstrologicalJourney
source: Start your astrological journey by creating a profile with your birth information.
ja: 出生情報でプロフィールを作成して、占星術の旅を始めてください。
tr: Doğum bilgilerinizle bir profil oluşturarak astrolojik yolculuğunuza başlayın.
zh: 通过创建包含您出生信息的档案来开始您的占星之旅。

source: Create Profile
ja: プロフィール作成
tr: Profil Oluştur
zh: 创建档案

source: Name
ja: 名前
tr: İsim
zh: 姓名

source: Birth Date
ja: 生年月日
tr: Doğum Tarihi
zh: 出生日期

source: Birth Time
ja: 出生時刻
tr: Doğum Saati
zh: 出生时间

source: Location
ja: 場所
tr: Konum
zh: 地点

source: Quick Actions
ja: クイックアクション
tr: Hızlı İşlemler
zh: 快速操作

source: Purple Star Chart
ja: 紫微斗数チャート
tr: Mor Yıldız Haritası
zh: 紫微斗数星盘

source: View astrology chart
ja: 占星チャートを表示
tr: Astroloji haritasını görüntüle
zh: 查看占星图

source: Four Pillars reading
ja: 四柱推命
tr: Dört Sütun okuması
zh: 四柱命理

source: Tarot Reading
ja: タロットリーディング
tr: Tarot Okuması
zh: 塔罗占卜

source: Mystical guidance
ja: 神秘的なガイダンス
tr: Mistik rehberlik
zh: 神秘指引

source: Detailed Analysis
ja: 詳細分析
tr: Detaylı Analiz
zh: 详细分析

source: In-depth interpretation
ja: 深い解釈
tr: Derinlemesine yorumlama
zh: 深度解读

source: Find compatibility
ja: 相性を見つける
tr: Uyumluluk bul
zh: 寻找匹配

source: Settings
ja: 設定
tr: Ayarlar
zh: 设置

source: App Settings
ja: アプリ設定
tr: Uygulama Ayarları
zh: 应用设置

source: Preferences and configuration
ja: 設定と構成
tr: Tercihler ve yapılandırma
zh: 偏好设置和配置

source: Language
ja: 言語
tr: Dil
zh: 语言

source: Change app language
ja: アプリの言語を変更
tr: Uygulama dilini değiştir
zh: 更改应用语言

source: About
ja: について
tr: Hakkında
zh: 关于

source: App information and version
ja: アプリ情報とバージョン
tr: Uygulama bilgisi ve sürümü
zh: 应用信息和版本

source: App preferences
ja: アプリの設定
tr: Uygulama tercihleri
zh: 应用偏好

source: Recent Activity
ja: 最近のアクティビティ
tr: Son Aktiviteler
zh: 最近活动

source: No recent calculations
ja: 最近の計算はありません
tr: Son hesaplama yok
zh: 没有最近的计算

# startExploringCosmicJourney
source: Start exploring your cosmic journey
ja: あなたの宇宙の旅を探索し始めてください
tr: Kozmik yolculuğunuzu keşfetmeye başlayın
zh: 开始探索您的宇宙之旅

source: Error loading content
ja: コンテンツの読み込みエラー
tr: İçerik yüklenirken hata
zh: 加载内容时出错

# errorLoadingHomeContent
source: There was an error loading the home screen content. This might be due to corrupted data.
ja: ホーム画面のコンテンツを読み込む際にエラーが発生しました。これは破損したデータが原因の可能性があります。
tr: Ana ekran içeriği yüklenirken bir hata oluştu. Bu, bozuk verilerden kaynaklanıyor olabilir.
zh: 加载主屏幕内容时出错。这可能是由于数据损坏造成的。

source: Retry
ja: 再試行
tr: Tekrar Dene
zh: 重试

source: Retry Loading
ja: 読み込みを再試行
tr: Yüklemeyi Tekrar Dene
zh: 重新加载

# retryLoadingQuestion
source: Would you like to retry loading the home screen content?
ja: ホーム画面のコンテンツの読み込みを再試行しますか？
tr: Ana ekran içeriğini yüklemeyi tekrar denemek ister misiniz?
zh: 您是否要重新尝试加载主屏幕内容？

source: Cancel
ja: キャンセル
tr: İptal
zh: 取消

source: Select Language
ja: 言語を選択
tr: Dil Seçin
zh: 选择语言

# languageSwitchingSoon
source: Language switching will be implemented soon
ja: 言語切り替えは近日実装予定です
tr: Dil değiştirme yakında uygulanacak
zh: 语言切换功能即将推出

source: About Astro Iztro
ja: Astro Iztroについて
tr: Astro Iztro Hakkında
zh: 关于 Astro Iztro

# aboutDescription
source: Version 1.0.0 A comprehensive Purple Star Astrology and BaZi calculation app with modern technology.
ja: バージョン 1.0.0 現代技術を活用した包括的な紫微斗数占星術と八字計算アプリ。
tr: Sürüm 1.0.0 Modern teknoloji ile kapsamlı Mor Yıldız Astrolojisi ve BaZi hesaplama uygulaması.
zh: 版本 1.0.0 一个全面的紫微斗数占星和八字计算应用，采用现代技术。

source: OK
tr: Tamam
zh: 确定

source: Unknown
ja: 不明
tr: Bilinmeyen
zh: 未知

source: No Chart Data
ja: チャートデータがありません
tr: Grafik Verisi Yok
zh: 没有图表数据

source: Please calculate chart first
ja: 最初にチャートを計算してください
tr: Lütfen önce grafiği hesaplayın
zh: 请先计算图表

source: Understanding Your Purple Star Chart
ja: あなたの紫微斗数チャートを理解する
tr: Mor Yıldız Grafiğinizi Anlamak
zh: 了解您的紫微斗数命盘

source: Discover how the stars influence your life path
ja: 星があなたの人生の道にどのように影響するかを発見しましょう
tr: Yıldızların yaşam yolunuzu nasıl etkilediğini keşfedin
zh: 探索星辰如何影响您的人生道路

source: What Star Colors Mean
ja: 星の色の意味
tr: Yıldız Renkleri Ne Anlama Gelir
zh: 星辰颜色的含义

source: Purple Stars
ja: 紫の星
tr: Mor Yıldızlar
zh: 紫色星辰

source: Major Influences
ja: 主な影響
tr: Ana Etkiler
zh: 主要影响

# purpleStarsDescription
source: These are your primary guiding stars that shape your core personality and life direction. They represent the strongest astrological forces in your chart.
ja: これらはあなたの核心的な性格と人生の方向を形作る主要な導きの星です。チャートの中で最も強い占星術の力を表しています。
tr: Bunlar, temel kişiliğinizi ve yaşam yönünüzü şekillendiren birincil rehber yıldızlarınızdır. Grafiğinizdeki en güçlü astrolojik güçleri temsil ederler.
zh: 这些是塑造您核心个性和人生方向的主要指导星辰。它们代表您命盘中最强大的占星力量。

source: Gold Stars
ja: 金色の星
tr: Altın Yıldızlar
zh: 金色星辰

# emphasisAndSelection
source: Emphasis & Selection
ja: 強調と選択
tr: Vurgu ve Seçim
zh: 强调与选择

# goldStarsDescription
source: Gold indicates areas of special focus or selection in your chart. These are highlighted aspects that deserve extra attention in your life.
ja: 金色はチャートの中で特別な焦点や選択の領域を示します。これらはあなたの人生で特別な注意を必要とする強調された側面です。
tr: Altın, grafiğinizde özel odaklanma veya seçim alanlarını gösterir. Bunlar hayatınızda ekstra dikkat gerektiren vurgulanan yönlerdir.
zh: 金色表示您命盘中特别关注或选择的领域。这些是您生活中需要额外关注的突出方面。

source: Green Stars
ja: 緑の星
tr: Yeşil Yıldızlar
zh: 绿色星辰

source: Supportive Influences
ja: 支援的な影響
tr: Destekleyici Etkiler
zh: 支持性影响

# greenStarsDescription
source: Green represents supportive and harmonious energies that help balance and enhance the areas they influence.
ja: 緑は、影響を与える領域のバランスを取り、強化するのに役立つ支援的で調和のとれたエネルギーを表しています。
tr: Yeşil, etkiledikleri alanları dengelemeye ve geliştirmeye yardımcı olan destekleyici ve uyumlu enerjileri temsil eder.
zh: 绿色代表支持和谐的能量，有助于平衡和增强它们所影响的领域。

source: Red Stars
ja: 赤い星
tr: Kırmızı Yıldızlar
zh: 红色星辰

source: Challenging Influences
ja: 挑戦的な影響
tr: Zorlayıcı Etkiler
zh: 挑战性影响

# redStarsDescription
source: Red indicates areas that may present challenges or require extra effort, but also opportunities for growth and transformation.
ja: 赤は、課題を提示したり追加の努力を必要とする領域を示しますが、成長と変容の機会でもあります。
tr: Kırmızı, zorluklar sunabilecek veya ekstra çaba gerektirebilecek alanları, aynı zamanda büyüme ve dönüşüm fırsatlarını gösterir.
zh: 红色表示可能带来挑战或需要额外努力的领域，同时也是成长和转变的机会。

source: Orange Stars
ja: オレンジ色の星
tr: Turuncu Yıldızlar
zh: 橙色星辰

source: Dynamic Energies
ja: 動的なエネルギー
tr: Dinamik Enerjiler
zh: 动态能量

# orangeStarsDescription
source: Orange represents dynamic, active energies that bring movement and change to the areas they influence.
ja: オレンジ色は、影響を与える領域に動きと変化をもたらす動的でアクティブなエネルギーを表しています。
tr: Turuncu, etkiledikleri alanlara hareket ve değişim getiren dinamik, aktif enerjileri temsil eder.
zh: 橙色代表动态、活跃的能量，为它们所影响的领域带来运动和变化。

source: Yellow Stars
ja: 黄色い星
tr: Sarı Yıldızlar
zh: 黄色星辰

# illuminationAndWisdom
source: Illumination & Wisdom
ja: 啓示と知恵
tr: Aydınlanma ve Bilgelik
zh: 启示与智慧

# yellowStarsDescription
source: Yellow represents wisdom, clarity, and spiritual insight that illuminates your understanding of these life areas.
ja: 黄色は、これらの生活領域に対するあなたの理解を照らす知恵、明晰さ、精神的洞察を表しています。
tr: Sarı, bu yaşam alanlarına ilişkin anlayışınızı aydınlatan bilgeliği, netliği ve ruhsal içgörüyü temsil eder.
zh: 黄色代表智慧、清晰和精神洞察力，照亮您对这些生活领域的理解。

source: How Properties Are Calculated
ja: 特性の計算方法
tr: Özellikler Nasıl Hesaplanır
zh: 属性如何计算

source: Birth Data Analysis
ja: 出生データ分析
tr: Doğum Verisi Analizi
zh: 出生数据分析

# birthDataAnalysisDescription
source: Your birth date, time, and location are converted to precise astronomical coordinates and lunar calendar dates.
ja: あなたの生年月日、時間、場所が正確な天文座標と太陰暦の日付に変換されます。
tr: Doğum tarihiniz, saatiniz ve konumunuz, kesin astronomik koordinatlara ve ay takvimi tarihlerine dönüştürülür.
zh: 您的出生日期、时间和地点被转换为精确的天文坐标和农历日期。

source: Palace Determination
ja: 宮殿の決定
tr: Saray Belirleme
zh: 宫位确定

# palaceDeterminationDescription
source: 12 life areas (palaces) are calculated based on your birth hour, creating a complete life blueprint from the Life Palace outward.
ja: 12の生活領域（宮殿）があなたの出生時間に基づいて計算され、命宮から外側に向かって完全な人生の設計図が作成されます。
tr: 12 yaşam alanı (saray), doğum saatinize göre hesaplanarak, Yaşam Sarayı'ndan dışarıya doğru eksiksiz bir yaşam planı oluşturulur.
zh: 根据您的出生时辰计算12个生活领域（宫位），从命宫向外创建完整的人生蓝图。

source: Star Placement
ja: 星の配置
tr: Yıldız Yerleşimi
zh: 星辰安置

# starPlacementDescription
source: Major and minor stars are placed in palaces using ancient formulas based on your birth year, month, day, and hour.
ja: 主要な星と副次的な星は、あなたの出生年、月、日、時に基づく古代の公式を使用して宮殿に配置されます。
tr: Büyük ve küçük yıldızlar, doğum yılınız, ayınız, gününüz ve saatinize dayalı antik formüller kullanılarak saraylara yerleştirilir.
zh: 使用基于您出生年、月、日、时的古老公式，将主要和次要星辰安置在宫位中。

source: Transformation Stars
ja: 変容の星
tr: Dönüşüm Yıldızları
zh: 变化星辰

# transformationStarsDescription
source: Special transformation stars (Lu, Quan, Ke, Ji) are calculated to show periods of change and fortune in your life.
ja: 特別な変容の星（禄、権、科、忌）があなたの人生の変化と運勢の期間を示すために計算されます。
tr: Özel dönüşüm yıldızları (Lu, Quan, Ke, Ji), hayatınızdaki değişim ve şans dönemlerini göstermek için hesaplanır.
zh: 计算特殊的变化星辰（禄、权、科、忌）来显示您生活中的变化和运势时期。

source: How You Are Calculated
ja: あなたの計算方法
tr: Nasıl Hesaplandığınız
zh: 您是如何被计算的

source: Core Personality
ja: 核心的な性格
tr: Temel Kişilik
zh: 核心个性

# corePersonalityDescription
source: Your fundamental nature is determined by the stars in your Life Palace, calculated from your exact birth hour and the position of the Purple Star (Zi Wei). This creates your unique personality blueprint.
ja: あなたの基本的な性質は、正確な出生時刻と紫微星（ジウェイ）の位置から計算された命宮の星によって決定されます。これがあなたの独自の性格の設計図を作り出します。
tr: Temel doğanız, tam doğum saatiniz ve Mor Yıldız'ın (Zi Wei) konumundan hesaplanan Yaşam Sarayı'ndaki yıldızlar tarafından belirlenir. Bu, benzersiz kişilik planınızı oluşturur.
zh: 您的基本性质由命宫中的星辰决定，根据您的确切出生时辰和紫微星的位置计算。这创造了您独特的个性蓝图。

source: Life Strengths
ja: 人生の強み
tr: Yaşam Güçleri
zh: 生命优势

# lifeStrengthsDescription
source: Your natural talents and abilities are revealed by the combination of major stars in different palaces, calculated using ancient formulas based on your birth year, month, and day.
ja: あなたの自然な才能と能力は、出生年、月、日に基づく古代の公式を使用して計算された、異なる宮殿における主要な星の組み合わせによって明らかになります。
tr: Doğal yetenekleriniz ve becerileriniz, doğum yılınız, ayınız ve gününüze dayalı antik formüller kullanılarak hesaplanan farklı saraylardaki büyük yıldızların kombinasyonu ile ortaya çıkar.
zh: 您的自然才能和能力通过不同宫位中主要星辰的组合显示出来，使用基于您出生年、月、日的古老公式计算。

source: Life Challenges
ja: 人生の課題
tr: Yaşam Zorlukları
zh: 生命挑战

# lifeChallengesDescription
source: Areas requiring growth are indicated by challenging star combinations and palace positions, calculated from your birth data and the relationships between different stars.
ja: 成長が必要な領域は、出生データと異なる星の間の関係から計算された、挑戦的な星の組み合わせと宮殿の位置によって示されます。
tr: Gelişim gerektiren alanlar, doğum verilerinizden ve farklı yıldızlar arasındaki ilişkilerden hesaplanan zorlayıcı yıldız kombinasyonları ve saray pozisyonları ile gösterilir.
zh: 需要成长的领域通过具有挑战性的星辰组合和宫位位置表示，根据您的出生数据和不同星辰之间的关系计算。

source: Destiny Path
ja: 運命の道
tr: Kader Yolu
zh: 命运路径

# destinyPathDescription
source: Your life direction is mapped through the sequence of palaces and the transformation stars (Lu, Quan, Ke, Ji), revealing your unique journey through time.
ja: あなたの人生の方向は、宮殿の配列と変容の星（禄、権、科、忌）を通じてマッピングされ、時間を通じたあなたの独自の旅を明らかにします。
tr: Yaşam yönünüz, sarayların sırası ve dönüşüm yıldızları (Lu, Quan, Ke, Ji) aracılığıyla haritalandırılarak, zaman içindeki benzersiz yolculuğunuzu ortaya çıkarır.
zh: 您的人生方向通过宫位序列和变化星辰（禄、权、科、忌）映射，揭示您在时间中的独特旅程。

source: How to Read Your Chart
ja: チャートの読み方
tr: Grafiğinizi Nasıl Okursunuz
zh: 如何阅读您的命盘

# tapOnPalaceTip
source: Tap on any palace to see detailed information about that life area and the stars within it.
ja: 任意の宮殿をタップすると、その生活領域と内部の星に関する詳細情報が表示されます。
tr: O yaşam alanı ve içindeki yıldızlar hakkında ayrıntılı bilgi görmek için herhangi bir saraya dokunun.
zh: 点击任何宫位，查看该生活领域和其中星辰的详细信息。

# useZoomControlsTip
source: Use the zoom controls to explore different parts of your chart in detail.
ja: ズームコントロールを使用して、チャートのさまざまな部分を詳細に探索できます。
tr: Grafiğinizin farklı bölümlerini ayrıntılı olarak keşfetmek için yakınlaştırma kontrollerini kullanın.
zh: 使用缩放控件详细探索您命盘的不同部分。

# toggleLanguageTip
source: Toggle between English and Chinese names to explore traditional terminology.
ja: 英語と中国語の名前を切り替えて、伝統的な用語を探索できます。
tr: Geleneksel terminolojiyi keşfetmek için İngilizce ve Çince isimler arasında geçiş yapın.
zh: 在英文和中文名称之间切换，探索传统术语。

source: Your Chart Summary
ja: あなたのチャート概要
tr: Grafik Özetiniz
zh: 您的命盘摘要

source: Palaces
ja: 宮殿
tr: Saraylar
zh: 宫位

source: stars
ja: 星
tr: yıldız
zh: 星辰

source: Major
ja: 主要
tr: Ana
zh: 主要

source: What Each Palace Means
ja: 各宮殿の意味
tr: Her Sarayın Anlamı
zh: 每个宫位的含义

# lifePalace
source: Life
ja: 命宮
tr: Yaşam
zh: 命宫

# lifePalaceDescription
source: Your core personality and life path
ja: あなたの核心的な性格と人生の道
tr: Temel kişiliğiniz ve yaşam yolunuz
zh: 您的核心个性和人生道路

# siblingsPalace
source: Siblings
ja: 兄弟宮
tr: Kardeşler
zh: 兄弟宫

# siblingsPalaceDescription
source: Relationships with siblings
ja: 兄弟姉妹との関係
tr: Kardeşlerle ilişkiler
zh: 与兄弟姐妹的关系

# spousePalace
source: Spouse
ja: 夫妻宮
tr: Eş
zh: 夫妻宫

# spousePalaceDescription
source: Marriage and partnerships
ja: 結婚とパートナーシップ
tr: Evlilik ve ortaklıklar
zh: 婚姻和伴侣关系

# childrenPalace
source: Children
ja: 子女宮
tr: Çocuklar
zh: 子女宫

# childrenPalaceDescription
source: Children and creativity
ja: 子供と創造性
tr: Çocuklar ve yaratıcılık
zh: 子女和创造力

# wealthPalace
source: Wealth
ja: 財帛宮
tr: Zenginlik
zh: 财帛宫

# wealthPalaceDescription
source: Money and resources
ja: お金と資源
tr: Para ve kaynaklar
zh: 金钱和资源

# healthPalace
source: Health
ja: 疾厄宮
tr: Sağlık
zh: 疾厄宫

# healthPalaceDescription
source: Physical well-being
ja: 身体的健康
tr: Fiziksel sağlık
zh: 身体健康

# travelPalace
source: Travel
ja: 遷移宮
tr: Seyahat
zh: 迁移宫

# travelPalaceDescription
source: Movement and change
ja: 移動と変化
tr: Hareket ve değişim
zh: 移动和变化

# friendsPalace
source: Friends
ja: 奴僕宮
tr: Arkadaşlar
zh: 奴仆宫

# friendsPalaceDescription
source: Social connections
ja: 社会的つながり
tr: Sosyal bağlantılar
zh: 社交关系

# careerPalace
source: Career
ja: 官禄宮
tr: Kariyer
zh: 官禄宫

# careerPalaceDescription
source: Work and reputation
ja: 仕事と評判
tr: İş ve itibar
zh: 工作和声誉

# propertyPalace
source: Property
ja: 田宅宮
tr: Mülk
zh: 田宅宫

# propertyPalaceDescription
source: Home and property
ja: 家と財産
tr: Ev ve mülkiyet
zh: 家庭和财产

# fortunePalace
source: Fortune
ja: 福徳宮
tr: Şans
zh: 福德宫

# fortunePalaceDescription
source: Luck and spirituality
ja: 運と精神性
tr: Şans ve maneviyat
zh: 运气和精神生活

# parentsPalace
source: Parents
ja: 父母宮
tr: Ebeveynler
zh: 父母宫

# parentsPalaceDescription
source: Family relationships
ja: 家族関係
tr: Aile ilişkileri
zh: 家庭关系

source: Loading Chart Data...
ja: チャートデータを読み込み中...
tr: Grafik Verisi Yükleniyor...
zh: 正在加载命盘数据...

# preparingCosmicBlueprint
source: Preparing your cosmic blueprint
ja: あなたの宇宙の設計図を準備しています
tr: Kozmik planınız hazırlanıyor
zh: 正在准备您的宇宙蓝图

source: Calculating Purple Star Chart...
ja: 紫微斗数チャートを計算中...
tr: Mor Yıldız Grafiği Hesaplanıyor...
zh: 正在计算紫微斗数命盘...

# mappingCelestialInfluences
source: Mapping the celestial influences
ja: 天体の影響をマッピングしています
tr: Göksel etkiler haritalanıyor
zh: 正在映射天体影响

# discoverBirthChartPatterns
source: Discover the hidden patterns in your birth chart and understand how the stars influence your life path
ja: あなたの出生チャートに隠されたパターンを発見し、星があなたの人生の道にどのように影響するかを理解しましょう
tr: Doğum grafiğinizdeki gizli desenleri keşfedin ve yıldızların yaşam yolunuzu nasıl etkilediğini anlayın
zh: 发现您出生命盘中的隐藏模式，了解星辰如何影响您的人生道路

source: Calculate Chart
ja: チャートを計算
tr: Grafik Hesapla
zh: 计算命盘

source: Refresh Chart
ja: チャートを更新
tr: Grafiği Yenile
zh: 刷新命盘

source: Four Pillars BaZi
ja: 四柱八字
tr: Dört Sütun BaZi
zh: 四柱八字

source: Calculating your BaZi...
ja: 八字を計算中...
tr: BaZi'niz hesaplanıyor...
zh: 正在计算您的八字...

source: Analyzing the cosmic influences
ja: 宇宙の影響を分析中
tr: Kozmik etkiler analiz ediliyor
zh: 正在分析宇宙影响

source: Discover Your Destiny
ja: あなたの運命を発見
tr: Kaderinizi Keşfedin
zh: 发现您的命运

# tapTheGoldenButtonToUnlock
source: Tap the golden button to unlock your Four Pillars chart and reveal the cosmic patterns that shape your life
ja: 金色のボタンをタップして四柱八字チャートのロックを解除し、あなたの人生を形作る宇宙のパターンを明らかにしてください
tr: Dört Sütun grafiğinizi kilidini açmak ve hayatınızı şekillendiren kozmik desenleri ortaya çıkarmak için altın butona dokunun
zh: 点击金色按钮解锁您的四柱八字命盘，揭示塑造您生活的宇宙模式

source: Four Pillars
ja: 四柱
tr: Dört Sütun
zh: 四柱

# year
source: Year {year}
ja: {year}年
tr: Yıl {year}
zh: 年

source: Month
ja: 月
tr: Ay
zh: 月

source: Day
ja: 日
tr: Gün
zh: 日

source: Hour
ja: 時
tr: Saat
zh: 时

source: Element Analysis
ja: 五行分析
tr: Element Analizi
zh: 五行分析

source: Wood
ja: 木
tr: Ağaç
zh: 木

source: Fire
ja: 火
tr: Ateş
zh: 火

source: Earth
ja: 土
tr: Toprak
zh: 土

source: Water
ja: 水
tr: Su
zh: 水

source: Strongest
ja: 最強
tr: En Güçlü
zh: 最强

source: Weakest
ja: 最弱
tr: En Zayıf
zh: 最弱

source: Balance
ja: バランス
tr: Denge
zh: 平衡

source: Recommendations
ja: 推奨事項
tr: Öneriler
zh: 建议

source: How your BaZi was calculated
ja: あなたの八字の計算方法
tr: BaZi'niz nasıl hesaplandı
zh: 您的八字是如何计算的

# weDeriveTheFourPillars
source: We derive the Four Pillars (Year, Month, Day, Hour) from your exact birth date and time. If enabled, True Solar Time adjustments are applied for accuracy.
ja: 正確な生年月日と時刻から四柱（年、月、日、時）を導き出します。有効な場合、精度のために真太陽時調整が適用されます。
tr: Dört Sütunu (Yıl, Ay, Gün, Saat) tam doğum tarihiniz ve saatinizden türetiyoruz. Etkinleştirilmişse, doğruluk için Gerçek Güneş Zamanı ayarlamaları uygulanır.
zh: 我们从您的确切出生日期和时间推导出四柱（年、月、日、时）。如果启用，会应用真太阳时调整以确保准确性。

# eachPillarConsistsOf
source: Each pillar consists of a Heavenly Stem and an Earthly Branch. These are mapped to the Five Elements and Yin/Yang to form your personal energy blueprint.
ja: 各柱は天干と地支で構成されています。これらは五行と陰陽にマッピングされ、あなたの個人的なエネルギーブループリントを形成します。
tr: Her sütun bir Göksel Kök ve Dünyevi Dal'dan oluşur. Bunlar Beş Element ve Yin/Yang ile eşleştirilerek kişisel enerji planınızı oluşturur.
zh: 每柱由天干和地支组成。这些映射到五行和阴阳，形成您的个人能量蓝图。

# chineseZodiacAndWesternZodiac
source: Chinese Zodiac and Western Zodiac are determined from the birth year and solar date respectively to give quick archetypal context.
ja: 中国の十二支と西洋の十二星座は、それぞれ生年と太陽日から決定され、迅速な原型コンテキストを提供します。
tr: Çin Burcu ve Batı Burcu, doğum yılı ve güneş tarihinden sırasıyla belirlenerek hızlı arketipsel bağlam sağlar.
zh: 中国十二生肖和西方星座分别从出生年份和太阳日期确定，提供快速的原型背景。

source: Zodiac
ja: 十二支
tr: Burç
zh: 生肖

source: Calculated at
ja: 計算日時
tr: Hesaplandığı tarih
zh: 计算时间

# pillarPillar
source: {pillarName} Pillar
ja: {pillarName}柱
tr: {pillarName} Sütunu
zh: {pillarName}柱

# thisPillarIsComposedOf
source: This pillar is composed of the Heavenly Stem and Earthly Branch shown below. Each maps to an element and Yin/Yang polarity. Together they describe tendencies related to the {pillarName} domain.
ja: この柱は以下に示す天干と地支で構成されています。それぞれが五行と陰陽の極性にマッピングされます。一緒に{pillarName}領域に関連する傾向を説明します。
tr: Bu sütun aşağıda gösterilen Göksel Kök ve Dünyevi Dal'dan oluşur. Her biri bir element ve Yin/Yang polaritesine eşlenir. Birlikte {pillarName} alanıyla ilgili eğilimleri tanımlarlar.
zh: 此柱由下面显示的天干和地支组成。每个都映射到五行和阴阳极性。它们一起描述与{pillarName}领域相关的倾向。

source: Stem
ja: 干
tr: Kök
zh: 干

source: Branch
ja: 支
tr: Dal
zh: 支

source: Hidden Stems
ja: 蔵干
tr: Gizli Kökler
zh: 藏干

# meaningStemsInfluence
source: Meaning: Stems influence how energy expresses outwardly, while branches describe context and timing. Element relations between stem and branch indicate support or tension.
ja: 意味：干はエネルギーが外側にどのように表現されるかに影響し、支は文脈とタイミングを説明します。干と支の間の五行関係は支援または緊張を示します。
tr: Anlam: Kökler enerjinin dışarıya nasıl ifade edildiğini etkilerken, dallar bağlam ve zamanlamayı tanımlar. Kök ve dal arasındaki element ilişkileri destek veya gerilimi gösterir.
zh: 含义：天干影响能量如何向外表达，而地支描述背景和时机。天干和地支之间的五行关系表示支持或紧张。

# weCountElementsFromBoth
source: We count elements from both the stem and branch of each pillar. With four pillars, there are 8 possible element contributions. Balance score = (min ÷ max) × 100.
ja: 各柱の干と支の両方から五行を数えます。四柱では8つの可能な五行の寄与があります。バランススコア = (最小 ÷ 最大) × 100。
tr: Her sütunun hem kökünden hem de dalından elementleri sayıyoruz. Dört sütunla birlikte 8 olası element katkısı vardır. Denge skoru = (min ÷ max) × 100.
zh: 我们从每柱的天干和地支都计算五行。四柱有8个可能的五行贡献。平衡分数 = (最小 ÷ 最大) × 100。

source: Balance Score
ja: バランススコア
tr: Denge Skoru
zh: 平衡分数

source: Total Contributions
ja: 総寄与
tr: Toplam Katkılar
zh: 总贡献

# meaningDominantElements
source: Meaning: Dominant elements describe strengths; missing or weak elements indicate areas to nurture. A higher balance score suggests smoother life dynamics.
ja: 意味：支配的な五行は強みを説明し、欠けているまたは弱い五行は育成すべき領域を示します。より高いバランススコアはより滑らかな人生の動きを示唆します。
tr: Anlam: Baskın elementler güçlü yanları tanımlar; eksik veya zayıf elementler beslenmesi gereken alanları gösterir. Daha yüksek denge skoru daha pürüzsüz yaşam dinamikleri önerir.
zh: 含义：主导五行描述优势；缺失或弱的五行表示需要培养的领域。更高的平衡分数表明更顺畅的人生动态。

source: Count
ja: 数
tr: Sayı
zh: 数量

# thisCountComesFromAdding
source: This count comes from adding occurrences of {element} from the stems and branches across the four pillars.
ja: この数は、四柱全体の干と支から{element}の出現を加算することから来ます。
tr: Bu sayı, dört sütun boyunca kökler ve dallardan {element} oluşumlarının eklenmesinden gelir.
zh: 这个数量来自四柱中天干和地支的{element}出现次数相加。

# woodGrowthCreativity
source: Wood - Growth, creativity, flexibility
ja: 木 - 成長、創造性、柔軟性
tr: Ağaç - Büyüme, yaratıcılık, esneklik
zh: 木 - 成长、创造力、灵活性
