Repository: osmandemiroz/astro-iztro
Catalog: lib/l10n/app_*.arb
Languages: ja, tr, zh

# practiceSelfCarePatience
source: Practice self-care and patience
ja: セルフケアと忍耐を実践してください
tr: Öz-bakım ve sabır pratiği yapın
zh: 练习自我关怀和耐心

source: Seek support when needed
ja: 必要な時はサポートを求めてください
tr: İhtiyaç duyduğunuzda destek arayın
zh: 需要时寻求支持

# avoidMajorDecisionsNow
source: Avoid making major decisions now
ja: 今は大きな決定を避けてください
tr: Şu anda büyük kararlar almaktan kaçının
zh: 现在避免重大决定

# maintainBalanceAllAreas
source: Maintain balance in all areas of life
ja: 人生のすべての分野でバランスを保ってください
tr: Hayatın tüm alanlarında dengeyi koruyun
zh: 在生活的所有领域保持平衡

# trustNaturalFlowEvents
source: Trust the natural flow of events
ja: 出来事の自然な流れを信じてください
tr: Olayların doğal akışına güvenin
zh: 相信事件的自然流动

# takeTimeReflectActing
source: Take time to reflect before acting
ja: 行動する前に考える時間を取ってください
tr: Harekete geçmeden önce düşünmek için zaman ayırın
zh: 行动前花时间思考

# avoidRushedDecisions
source: Avoid making rushed decisions
ja: 急いだ決定を避けてください
tr: Acele kararlar almaktan kaçının
zh: 避免匆忙的决定

# practiceGratitudePositiveThinking
source: Practice gratitude and positive thinking
ja: 感謝とポジティブ思考を実践してください
tr: Şükran ve pozitif düşünce pratiği yapın
zh: 练习感恩和积极思考

# chooseSeeGoodEverySituation
source: I choose to see the good in every situation
ja: すべての状況で良いことを見ることを選びます
tr: Her durumda iyiyi görmeyi seçiyorum
zh: 我选择在每个情况下看到好的

# intuitionInnerWisdom
source: Intuition and inner wisdom
ja: 直感と内なる知恵
tr: Sezgi ve iç bilgelik
zh: 直觉和内在智慧

# selfReflectionSolitude
source: Self-reflection and solitude
ja: 自己反省と孤独
tr: Öz-düşünüm ve yalnızlık
zh: 自我反思和独处

# balanceModeration
source: Balance and moderation
ja: バランスと節度
tr: Denge ve ölçülülük
zh: 平衡和节制

# fairnessTruth
source: Fairness and truth
ja: 公正と真実
tr: Adalet ve gerçek
zh: 公正和真理

# innerStrengthCourage
source: Inner strength and courage
ja: 内なる強さと勇気
tr: İç güç ve cesaret
zh: 内在力量和勇气

source: Emotional communication
ja: 感情的なコミュニケーション
tr: Duygusal iletişim
zh: 情感沟通

# selfLoveBoundaries
source: Self-love and boundaries
ja: 自己愛と境界
tr: Öz-sevgi ve sınırlar
zh: 自爱和边界

source: Skill development
ja: スキル開発
tr: Beceri geliştirme
zh: 技能发展

source: Professional networking
ja: 専門的なネットワーキング
tr: Profesyonel ağ kurma
zh: 专业网络建设

source: Financial planning
ja: 財務計画
tr: Mali planlama
zh: 财务规划

source: Responsible spending
ja: 責任ある支出
tr: Sorumlu harcama
zh: 负责任的支出

# lunarCyclesInfluenceTiming
source: Lunar cycles may influence timing
ja: 月のサイクルがタイミングに影響する可能性があります
tr: Ay döngüleri zamanlamayı etkileyebilir
zh: 月球周期可能影响时机

# naturalCyclesImportant
source: Natural cycles are important
ja: 自然なサイクルが重要です
tr: Doğal döngüler önemlidir
zh: 自然周期很重要

# withinMonthsNewConnections
source: Within 1-3 months for new connections
ja: 新しいつながりのために1-3ヶ月以内
tr: Yeni bağlantılar için 1-3 ay içinde
zh: 新联系在1-3个月内

# monthsDeeperCommitments
source: 6-12 months for deeper commitments
ja: より深いコミットメントのために6-12ヶ月
tr: Daha derin bağlılıklar için 6-12 ay
zh: 更深承诺需要6-12个月

# monthsCareerChanges
source: Within 3-6 months for career changes
ja: キャリア変更のために3-6ヶ月以内
tr: Kariyer değişiklikleri için 3-6 ay içinde
zh: 职业变化在3-6个月内

# yearsMajorCareerGrowth
source: 1-2 years for major career growth
ja: 主要なキャリア成長のために1-2年
tr: Önemli kariyer büyümesi için 1-2 yıl
zh: 重大职业发展需要1-2年

# monthsFinancialImprovement
source: Within 6-12 months for financial improvement
ja: 財政改善のために6-12ヶ月以内
tr: Mali iyileşme için 6-12 ay içinde
zh: 财务改善在6-12个月内

# yearsLongTermGoals
source: 2-3 years for long-term financial goals
ja: 長期的な財政目標のために2-3年
tr: Uzun vadeli mali hedefler için 2-3 yıl
zh: 长期财务目标需要2-3年

# takeTimeReflectDeciding
source: Take time to reflect before deciding
ja: 決定する前に考える時間を取ってください
tr: Karar vermeden önce düşünmek için zaman ayırın
zh: 决定前花时间思考

# trustIntuitionTiming
source: Trust your intuition in timing
ja: タイミングで直感を信じてください
tr: Zamanlamada sezgilerinize güvenin
zh: 在时机上相信您的直觉

# newMoonNewBeginnings
source: New moon for new beginnings
ja: 新しい始まりのための新月
tr: Yeni başlangıçlar için yeni ay
zh: 新开始的新月

# fullMoonCompletionClarity
source: Full moon for completion and clarity
ja: 完成と明確さのための満月
tr: Tamamlanma ve netlik için dolunay
zh: 完成和清晰度的满月

# daytimeHoursPositiveActions
source: Daytime hours for positive actions
ja: ポジティブな行動のための日中時間
tr: Pozitif eylemler için gündüz saatleri
zh: 积极行动的白天时间

# sunnyDaysImportantDecisions
source: Sunny days for important decisions
ja: 重要な決定のための晴れた日
tr: Önemli kararlar için güneşli günler
zh: 重要决定的晴天

# springNewProjectsGrowth
source: Spring for new projects and growth
ja: 新しいプロジェクトと成長のための春
tr: Yeni projeler ve büyüme için ilkbahar
zh: 新项目和成长的春天

# autumnReflectionPlanning
source: Autumn for reflection and planning
ja: 反省と計画のための秋
tr: Düşünüm ve planlama için sonbahar
zh: 反思和规划的秋天

# fridayEveningsRomanticActivities
source: Friday evenings for romantic activities
ja: ロマンチックな活動のための金曜日の夜
tr: Romantik aktiviteler için cuma akşamları
zh: 周五晚上适合浪漫活动

# venusRuledHoursRelationshipDecisions
source: Venus-ruled hours for relationship decisions
ja: 関係決定のための金星時間
tr: İlişki kararları için Venüs saatleri
zh: 金星时间适合关系决定

# mondayMorningsNewInitiatives
source: Monday mornings for new initiatives
ja: 新しいイニシアチブのための月曜日の朝
tr: Yeni girişimler için pazartesi sabahları
zh: 周一早上适合新倡议

# mercuryRuledHoursCommunication
source: Mercury-ruled hours for communication
ja: コミュニケーションのための水星時間
tr: İletişim için Merkür saatleri
zh: 水星时间适合沟通

# newMoonFinancialPlanning
source: New moon for financial planning
ja: 財務計画のための新月
tr: Mali planlama için yeni ay
zh: 新月适合财务规划

# jupiterRuledHoursAbundanceWork
source: Jupiter-ruled hours for abundance work
ja: 豊かさの仕事のための木星時間
tr: Bolluk çalışması için Jüpiter saatleri
zh: 木星时间适合丰盛工作

# patienceRequiredTimingNotRight
source: Patience is required - timing is not yet right
ja: 忍耐が必要です - タイミングはまだ正しくありません
tr: Sabır gerekiyor - zamanlama henüz doğru değil
zh: 需要耐心 - 时机还不合适

# changeConstantBeFlexible
source: Change is constant - be flexible with timing
ja: 変化は絶え間ない - タイミングで柔軟でいてください
tr: Değişim süreklidir - zamanlamada esnek olun
zh: 变化是持续的 - 在时机上保持灵活

# endingsCreateSpaceNewBeginnings
source: Endings create space for new beginnings
ja: 終わりは新しい始まりのためのスペースを作ります
tr: Sonlar yeni başlangıçlar için alan yaratır
zh: 结束为新开始创造空间

# suddenChangesAccelerateTiming
source: Sudden changes may accelerate timing
ja: 突然の変化がタイミングを加速する可能性があります
tr: Ani değişiklikler zamanlamayı hızlandırabilir
zh: 突然变化可能加速时机

# trustIntuitionAboutTiming
source: Trust your intuition about timing
ja: タイミングについて直感を信じてください
tr: Zamanlama konusunda sezgilerinize güvenin
zh: 在时机上相信您的直觉

# externalFactorsInfluenceTiming
source: External factors may influence timing
ja: 外部要因がタイミングに影響する可能性があります
tr: Dış faktörler zamanlamayı etkileyebilir
zh: 外部因素可能影响时机

# personalReadinessImportantTiming
source: Personal readiness is as important as external timing
ja: 個人的な準備は外部タイミングと同じくらい重要です
tr: Kişisel hazırlık dış zamanlama kadar önemlidir
zh: 个人准备与外部时机同样重要

# within1To3MonthsNewConnections
source: Within 1-3 months for new connections
ja: 新しいつながりのために1-3ヶ月以内
tr: Yeni bağlantılar için 1-3 ay içinde
zh: 新联系在1-3个月内

# sixToTwelveMonthsDeeperCommitments
source: 6-12 months for deeper commitments
ja: より深いコミットメントのために6-12ヶ月
tr: Daha derin taahhütler için 6-12 ay
zh: 更深承诺需要6-12个月

# within3To6MonthsCareerChanges
source: Within 3-6 months for career changes
ja: キャリア変更のために3-6ヶ月以内
tr: Kariyer değişiklikleri için 3-6 ay içinde
zh: 职业变化在3-6个月内

# oneToTwoYearsMajorCareerGrowth
source: 1-2 years for major career growth
ja: 主要なキャリア成長のために1-2年
tr: Önemli kariyer gelişimi için 1-2 yıl
zh: 重大职业发展需要1-2年

# within6To12MonthsFinancialImprovement
source: Within 6-12 months for financial improvement
ja: 財務改善のために6-12ヶ月以内
tr: Finansal iyileşme için 6-12 ay içinde
zh: 财务改善在6-12个月内

# twoToThreeYearsLongTermFinancialGoals
source: 2-3 years for long-term financial goals
ja: 長期的な財務目標のために2-3年
tr: Uzun vadeli finansal hedefler için 2-3 yıl
zh: 长期财务目标需要2-3年

source: Take time to reflect before deciding
ja: 決定する前に振り返る時間を取りましょう
tr: Karar vermeden önce düşünmek için zaman ayırın
zh: 决定前花时间反思

# trustIntuitionInTiming
source: Trust your intuition in timing
ja: タイミングで直感を信じてください
tr: Zamanlamada sezgilerinize güvenin
zh: 在时机上相信您的直觉

# emotionalAwarenessHighlighted
source: Emotional awareness is highlighted
ja: 感情的な意識が強調されています
tr: Duygusal farkındalık vurgulanıyor
zh: 情感意识被强调

# intuitiveAbilitiesEnhanced
source: Intuitive abilities are enhanced
ja: 直感的能力が向上しています
tr: Sezgisel yetenekler geliştiriliyor
zh: 直觉能力得到增强

# emotionalHealingGrowth
source: Emotional healing and growth
ja: 感情的な癒しと成長
tr: Duygusal iyileşme ve büyüme
zh: 情感治愈和成长

# emotionalChallengesOvercome
source: Emotional challenges to overcome
ja: 克服すべき感情的な課題
tr: Aşılması gereken duygusal zorluklar
zh: 需要克服的情感挑战

# feelingPressuredRushed
source: Feeling pressured or rushed
ja: 圧迫感や急がされている感じ
tr: Baskı altında veya acele ediyormuş gibi hissetme
zh: 感到压力或匆忙

source: Practice emotional regulation
ja: 感情的な調節を実践してください
tr: Duygusal düzenleme pratiği yapın
zh: 练习情感调节

source: Experiencing difficult emotions
ja: 困難な感情を経験しています
tr: Zor duygular yaşıyor
zh: 经历困难的情感

source: Focus on emotional self-care
ja: 感情的なセルフケアに焦点を当ててください
tr: Duygusal öz-bakıma odaklanın
zh: 专注于情感自我关怀

# feelingOptimisticHopeful
source: Feeling optimistic and hopeful
ja: 楽観的で希望に満ちた気持ち
tr: İyimser ve umutlu hissetme
zh: 感到乐观和充满希望

# sharePositiveEnergyOthers
source: Share positive energy with others
ja: 他の人とポジティブなエネルギーを分かち合ってください
tr: Pozitif enerjinizi başkalarıyla paylaşın
zh: 与他人分享积极能量

source: Maintaining emotional balance
ja: 感情的なバランスを維持しています
tr: Duygusal dengeyi koruyor
zh: 保持情感平衡

source: Continue emotional awareness practices
ja: 感情的な意識の実践を続けてください
tr: Duygusal farkındalık pratiklerine devam edin
zh: 继续情感意识实践

source: Destiny Analysis
ja: 運命分析
tr: Kader Analizi

source: Select Year
ja: 年を選択
tr: Yıl Seçin

source: Yearly
ja: 年間
tr: Yıllık

source: Monthly
ja: 月間
tr: Aylık

source: Daily
ja: 日別
tr: Günlük

source: Analyzing Your Destiny...
ja: あなたの運命を分析中...
tr: Kaderiniz Analiz Ediliyor...

# unlockingSecretsOfStars
source: Unlocking the secrets of the stars
ja: 星の秘密を解き明かしています
tr: Yıldızların sırlarını açığa çıkarıyor

# unlockCosmicPatterns
source: Unlock the cosmic patterns that shape your life path and reveal the hidden influences of the stars
ja: あなたの人生の道を形作る宇宙のパターンを解き明かし、星の隠された影響を明らかにしてください
tr: Yaşam yolunuzu şekillendiren kozmik desenleri açığa çıkarın ve yıldızların gizli etkilerini ortaya çıkarın

source: Refresh Analysis
ja: 分析を更新
tr: Analizi Yenile

source: Export Analysis
ja: 分析をエクスポート
tr: Analizi Dışa Aktar

source: Scroll to Top
ja: トップにスクロール
tr: Yukarı Kaydır

# thisWouldScrollToTop
source: This would scroll to the top of the page
ja: これでページのトップにスクロールします
tr: Bu sayfanın en üstüne kaydırır

source: Calculating Your Fortune...
ja: あなたの運勢を計算中...
tr: Şansınız Hesaplanıyor...

# unlockingSecretsOfYear
source: Unlocking the secrets of {year}
ja: {year}年の秘密を解き明かしています
tr: {year} yılının sırlarını açığa çıkarıyor

source: Ready to Calculate Fortune
ja: 運勢計算の準備完了
tr: Şans Hesaplamaya Hazır

# tapButtonToCalculateFortune
source: Tap the button below to calculate your fortune
ja: 運勢を計算するには下のボタンをタップしてください
tr: Şansınızı hesaplamak için aşağıdaki düğmeye dokunun

source: for {year}
ja: {year}年用
tr: {year} için

source: Calculate Fortune
ja: 運勢を計算
tr: Şansı Hesapla

source: Fortune Analysis for {year}
ja: {year}年の運勢分析
tr: {year} Yılı İçin Şans Analizi

source: Life Period
ja: 人生期間
tr: Yaşam Dönemi

source: Grand Limit Cycle
ja: 大限サイクル
tr: Büyük Limit Döngüsü

source: Small Limit Cycle
ja: 小限サイクル
tr: Küçük Limit Döngüsü

source: Annual Fortune
ja: 年運
tr: Yıllık Şans

source: Refresh Fortune
ja: 運勢を更新
tr: Şansı Yenile

source: Element Strengths
ja: 五行の強さ
tr: Element Güçleri

source: Summary
ja: 要約
tr: Özet

source: Palace Influences
ja: 宮位の影響
tr: Saray Etkileri

source: Life Areas & Star Influences
ja: 人生領域と星の影響
tr: Yaşam Alanları ve Yıldız Etkileri

source: star
ja: 星
tr: yıldız

# thisPalaceContainsStars
source: This palace contains {count} star(s) affecting {palace}
ja: この宮位には{palace}に影響する{count}個の星が含まれています
tr: Bu saray {palace} alanını etkileyen {count} yıldız içeriyor

source: Close
ja: 閉じる
tr: Kapat

source: Category
ja: カテゴリ
tr: Kategori

source: Palace
ja: 宮位
tr: Saray

source: Brightness
ja: 明度
tr: Parlaklık

source: Transformation
ja: 変化
tr: Dönüşüm

source: Degree
ja: 度数
tr: Derece

source: Life Recommendations
ja: 人生の推奨事項
tr: Yaşam Önerileri

source: Got it
ja: 了解
tr: Anladım

source: No summary available
ja: 要約は利用できません
tr: Özet mevcut değil

# palaceLife
source: Life
ja: 命宮
tr: Yaşam

# palaceSiblings
source: Siblings
ja: 兄弟宮
tr: Kardeşler

# palaceSpouse
source: Spouse
ja: 夫妻宮
tr: Eş

# palaceChildren
source: Children
ja: 子女宮
tr: Çocuklar

# palaceWealth
source: Wealth
ja: 財帛宮
tr: Zenginlik

# palaceHealth
source: Health
ja: 疾厄宮
tr: Sağlık

# palaceTravel
source: Travel
ja: 遷移宮
tr: Seyahat

# palaceCareer
source: Career
ja: 官禄宮
tr: Kariyer

# palaceFriends
source: Friends
ja: 交友宮
tr: Arkadaşlar

# palaceParents
source: Parents
ja: 父母宮
tr: Ebeveynler

# palaceProperty
source: Property
ja: 田宅宮
tr: Mülk

# palaceDestiny
source: Destiny
ja: 福德宮
tr: Kader

# elementWater
source: Water
ja: 水
tr: Su

# elementWood
source: Wood
ja: 木
tr: Ağaç

# elementFire
source: Fire
ja: 火
tr: Ateş

# elementEarth
source: Earth
ja: 土
tr: Toprak

# starSun
source: Sun
ja: 太陽
tr: Güneş

# starArmyDestroyer
source: Army Destroyer
ja: 破軍
tr: Ordu Yokedici

# starRightSupport
source: Right Support
ja: 右弼
tr: Sağ Destek

# starIntegrity
source: Integrity
ja: 廉貞
tr: Dürüstlük

# starBellStar
source: Bell Star
ja: 鈴星
tr: Çan Yıldızı

# palaceInsightDescription
source: This section summarizes how stars in the {palace} palace affect that life area. The influence is derived from the number and type of stars placed here in your chart.
ja: このセクションでは、{palace}宮の星がその人生領域にどのような影響を与えるかをまとめています。影響は、あなたのチャートでここに配置された星の数と種類から導き出されます。
tr: Bu bölüm, {palace} sarayındaki yıldızların o yaşam alanını nasıl etkilediğini özetler. Etki, haritanızda buraya yerleştirilen yıldızların sayısı ve türünden türetilir.

# elementStars
source: Element: {element} • Stars: {count}
ja: 五行: {element} • 星数: {count}
tr: Element: {element} • Yıldızlar: {count}

# starsList
source: Stars: {stars}
ja: 星: {stars}
tr: Yıldızlar: {stars}

# lifePeriodDescription
source: Your current phase reflects your age and traditional life stages.
ja: 現在の段階は、あなたの年齢と伝統的な人生の段階を反映しています。
tr: Mevcut aşamanız yaşınızı ve geleneksel yaşam evrelerini yansıtır.

source: Focus
ja: 焦点
tr: Odak

source: Challenges
ja: 課題
tr: Zorluklar

# grandLimitDescription
source: This runs in 10-year cycles derived from your age.
ja: これは、あなたの年齢から導き出される10年周期で実行されます。
tr: Bu, yaşınızdan türetilen 10 yıllık döngülerde çalışır.

source: Cycle
ja: サイクル
tr: Döngü

source: Years remaining
ja: 残り年数
tr: Kalan yıllar

# smallLimitDescription
source: A 1-year focus within the grand cycle.
ja: 大サイクル内での1年間の焦点。
tr: Büyük döngü içinde 1 yıllık odak.

source: Theme
ja: テーマ
tr: Tema

# annualFortuneDescription
source: Overall rating combines year element relations, lucky aspects and challenges.
ja: 総合評価は、年要素の関係、幸運な側面、課題を組み合わせたものです。
tr: Genel değerlendirme, yıl elementi ilişkileri, şanslı yönler ve zorlukları birleştirir.

source: Year Element
ja: 年エレメント
tr: Yıl Elementi

source: Relation to birth year
ja: 生年との関係
tr: Doğum yılına göre ilişki

source: Best months
ja: 最良の月
tr: En iyi aylar

source: Challenging months
ja: 困難な月
tr: Zorlu aylar

# fortuneCardSummary
source: This card summarizes calculated insights for your selected year.
ja: このカードは、選択した年の計算された洞察をまとめています。
tr: Bu kart, seçtiğiniz yıl için hesaplanan içgörüleri özetler.

# elementStrengthDescription
source: Strength is based on how many times this element appears across your four pillars.
ja: 強さは、この要素が四柱の間で何回現れるかに基づいています。
tr: Güç, bu elementin dört sütununuzda kaç kez göründüğüne dayanır.

source: scale
ja: スケール
tr: ölçek

source: Element Balance
ja: 要素バランス
tr: Element Dengesi

# elementBalanceDescription
source: Balance score reflects how even your five elements are. We compute a simple ratio between the least and most frequent elements.
ja: バランススコアは、5つの要素がどれだけ均等であるかを反映します。最も少ない要素と最も頻繁な要素の間の簡単な比率を計算します。
tr: Denge skoru, beş elementinizin ne kadar eşit olduğunu yansıtır. En az ve en sık görülen elementler arasında basit bir oran hesaplıyoruz.

source: Score
ja: スコア
tr: Skor

source: Your score
ja: あなたのスコア
tr: Skorunuz

source: Very Strong
ja: 非常に強い
tr: Çok Güçlü

source: Strong
ja: 強い
tr: Güçlü

source: Moderate
ja: 中程度
tr: Orta

source: Weak
ja: 弱い
tr: Zayıf

# pleaseCreateProfileFirst
source: Please create a profile first
ja: まずプロフィールを作成してください
tr: Lütfen önce bir profil oluşturun

# fortuneCalculatedSuccessfully
source: Fortune for year {year} calculated successfully!
ja: {year}年の運勢が正常に計算されました！
tr: {year} yılı için şans başarıyla hesaplandı!

# failedToCalculateFortune
source: Failed to calculate fortune for selected year: {error}
ja: 選択した年の運勢計算に失敗しました: {error}
tr: Seçilen yıl için şans hesaplanamadı: {error}

source: Go back
ja: 戻る
tr: Geri dön

source: Back
ja: 戻る
tr: Geri

source: Select Profiles for Compatibility
ja: 相性分析のためのプロフィール選択
tr: Uyumluluk için Profilleri Seçin

source: Profile 1 (Your Profile)
ja: プロフィール1（あなたのプロフィール）
tr: Profil 1 (Sizin Profiliniz)

source: Profile 2 (Other Person)
ja: プロフィール2（相手の人）
tr: Profil 2 (Diğer Kişi)

source: Create new profile
ja: 新しいプロフィールを作成
tr: Yeni profil oluştur

source: Refresh profiles
ja: プロフィールを更新
tr: Profilleri yenile

# selectDifferentProfileToContinue
source: Select a different profile for the other person to continue.
ja: 続行するには相手の人として異なるプロフィールを選択してください。
tr: Devam etmek için diğer kişi için farklı bir profil seçin.

# noCurrentProfileFound
source: No current profile found. Please create a profile first.
ja: 現在のプロフィールが見つかりません。まずプロフィールを作成してください。
tr: Mevcut profil bulunamadı. Lütfen önce bir profil oluşturun.

source: Select a profile
ja: プロフィールを選択
tr: Bir profil seçin

# noOtherProfilesAvailable
source: No other profiles available. Create a profile for the other person to analyze compatibility.
ja: 他のプロフィールはありません。相性分析のために相手の人のプロフィールを作成してください。
tr: Başka profil mevcut değil. Uyumluluk analizi için diğer kişi için bir profil oluşturun.

source: Calculate Your Compatibility
ja: あなたの相性を計算
tr: Uyumluluğunuzu Hesaplayın

source: Your Compatibility Results
ja: あなたの相性結果
tr: Uyumluluk Sonuçlarınız

source: Your Overall Compatibility
ja: あなたの総合相性
tr: Genel Uyumluluğunuz

source: Your Detailed Analysis
ja: あなたの詳細分析
tr: Detaylı Analiziniz

source: Sun Sign
ja: 太陽サイン
tr: Güneş Burcu

source: Your Relationship Recommendations
ja: あなたの関係推奨事項
tr: İlişki Önerileriniz

source: Future Insights
ja: 将来の洞察
tr: Gelecek Öngörüleri

source: Overall Compatibility
ja: 総合相性
tr: Genel Uyumluluk

source: Future Compatibility Insights
ja: 将来の相性洞察
tr: Gelecek Uyumluluk Öngörüleri

# overallScoreExplanation
source: Overall score blends Sun Sign (30%), Element (25%), Timing (20%), Chinese Zodiac Year (15%), and Hour Branch (10%).
ja: 総合スコアは太陽サイン（30％）、エレメント（25％）、タイミング（20％）、中国干支年（15％）、時間支（10％）をブレンドしています。
tr: Genel puan Güneş Burcu (%30), Element (%25), Zamanlama (%20), Çin Zodyak Yılı (%15) ve Saat Dalını (%10) harmanlıyor.

# sunSignExplanation
source: Traditional Western zodiac matrix scoring.
ja: 伝統的な西洋占星術マトリックススコアリング。
tr: Geleneksel Batı zodyak matris puanlaması.

# elementExplanation
source: Five-element interaction table (Wood, Fire, Earth, Metal, Water).
ja: 五行相互作用表（木、火、土、金、水）。
tr: Beş element etkileşim tablosu (Ahşap, Ateş, Toprak, Metal, Su).

# timingExplanation
source: Age gap, seasonal rhythm, and cycle alignment.
ja: 年齢差、季節的リズム、サイクル調整。
tr: Yaş farkı, mevsimsel ritim ve döngü uyumu.

# recommendationsExplanation
source: Suggestions are derived from your overall score to amplify strengths and address challenges.
ja: 提案はあなたの総合スコアから導き出され、強みを増幅し課題に対処します。
tr: Öneriler, güçlü yanları artırmak ve zorlukları ele almak için genel puanınızdan türetilir.

# futureInsightsExplanation
source: We compute yearly projections from trend analysis over multiple years and highlight peaks and dips.
ja: 複数年にわたるトレンド分析から年間予測を計算し、ピークと下降を強調します。
tr: Birden fazla yıl üzerindeki trend analizinden yıllık projeksiyonlar hesaplayıp zirveleri ve düşüşleri vurgularız.

# prediction
source: Prediction: {prediction}
ja: 予測: {prediction}
tr: Tahmin: {prediction}

# yearBreakdownExplanation
source: Composed yearly score with explicit contributions.
ja: 明示的な貢献による構成年間スコア。
tr: Açık katkılarla oluşturulmuş yıllık puan.

source: Overall
ja: 総合
tr: Genel

source: Year Animal
ja: 年動物
tr: Yıl Hayvanı

source: Components
ja: コンポーネント
tr: Bileşenler

source: Baseline pair
ja: ベースラインペア
tr: Temel çift

source: Year element support
ja: 年エレメントサポート
tr: Yıl elementi desteği

source: Year animal support
ja: 年動物サポート
tr: Yıl hayvanı desteği

source: Timing synergy
ja: タイミングシナジー
tr: Zamanlama sinerjisi

# timingBreakdown
source: Timing
ja: タイミング
tr: Zamanlama

# energyLevelsAndSynergy
source: Energy levels: {energy1} & {energy2} • Synergy {synergy}
ja: エネルギーレベル: {energy1} & {energy2} • シナジー {synergy}
tr: Enerji seviyeleri: {energy1} & {energy2} • Sinerji {synergy}

source: No analysis available
ja: 分析は利用できません
tr: Analiz mevcut değil

source: No prediction available
ja: 予測は利用できません
tr: Tahmin mevcut değil

# failedToLoadProfiles
source: Failed to load profiles: {error}
ja: プロフィールの読み込みに失敗しました: {error}
tr: Profiller yüklenemedi: {error}

# failedToSetProfile2
source: Failed to set profile 2: {error}
ja: プロフィール2の設定に失敗しました: {error}
tr: Profil 2 ayarlanamadı: {error}

# pleaseSelectBothProfiles
source: Please select both profiles for compatibility analysis
ja: 相性分析のために両方のプロフィールを選択してください
tr: Uyumluluk analizi için lütfen her iki profili de seçin

# pleaseSelectDifferentProfiles
source: Please select different profiles for compatibility analysis
ja: 相性分析のために異なるプロフィールを選択してください
tr: Uyumluluk analizi için lütfen farklı profiller seçin

# failedToCalculateCompatibility
source: Failed to calculate compatibility: {error}
ja: 相性計算に失敗しました: {error}
tr: Uyumluluk hesaplanamadı: {error}

source: Profile Added
ja: プロフィール追加
tr: Profil Eklendi

# newProfileAddedAndSelected
source: New profile "{name}" has been added and selected for compatibility analysis
ja: 新しいプロフィール"{name}"が追加され、相性分析のために選択されました
tr: Yeni profil "{name}" eklendi ve uyumluluk analizi için seçildi

# cannotCreateSameProfile
source: Cannot create a profile with the same details as your current profile
ja: 現在のプロフィールと同じ詳細でプロフィールを作成することはできません
tr: Mevcut profilinizle aynı detaylara sahip bir profil oluşturamazsınız

# settingsTitle
source: SETTINGS
tr: AYARLAR

source: Reset to Defaults
tr: Varsayılanlara Sıfırla

source: Calculation Settings
tr: Hesaplama Ayarları

source: True Solar Time
tr: Gerçek Güneş Zamanı

# trueSolarTimeDescription
source: Use true solar time for calculations
tr: Hesaplamalar için gerçek güneş zamanı kullan

source: Show Brightness
tr: Parlaklığı Göster

# showBrightnessDescription
source: Display star brightness information
tr: Yıldız parlaklığı bilgisini görüntüle

source: Show Transformations
tr: Dönüşümleri Göster

# showTransformationsDescription
source: Display star transformations
tr: Yıldız dönüşümlerini görüntüle

source: Auto Save Calculations
tr: Hesaplamaları Otomatik Kaydet

# autoSaveCalculationsDescription
source: Automatically save calculation results
tr: Hesaplama sonuçlarını otomatik olarak kaydet

source: Advanced Features
tr: Gelişmiş Özellikler

source: Advanced Analysis
tr: Gelişmiş Analiz

# advancedAnalysisDescription
source: Enable detailed analysis features
tr: Detaylı analiz özelliklerini etkinleştir

source: Detailed Star Analysis
tr: Detaylı Yıldız Analizi

# detailedStarAnalysisDescription
source: Show comprehensive star information
tr: Kapsamlı yıldız bilgilerini göster

source: Auto Save Palace Analysis
tr: Saray Analizini Otomatik Kaydet

# autoSavePalaceAnalysisDescription
source: Automatically save palace analysis data
tr: Saray analizi verilerini otomatik olarak kaydet

source: Transformation Effects
tr: Dönüşüm Etkileri
