Repository: osmandemiroz/astro-iztro
Catalog: lib/l10n/app_*.arb
Languages: ja, tr, zh

# transformationEffectsDescription
source: Show transformation effects
tr: Dönüşüm etkilerini göster

source: Fortune Timing
tr: Şans Zamanlaması

# fortuneTimingDescription
source: Enable fortune timing calculations
tr: Şans zamanlama hesaplamalarını etkinleştir

source: Data Management
tr: Veri Yönetimi

source: Storage Used
tr: Kullanılan Depolama

source: Total Profiles
tr: Toplam Profil

source: Calculations Stored
tr: Saklanan Hesaplamalar

source: Export Data
tr: Veriyi Dışa Aktar

source: Clear Data
tr: Veriyi Temizle

source: Reset Onboarding
tr: Tanıtımı Sıfırla

# purpleStarAstrologyBazi
source: Purple Star Astrology & BaZi Analysis
tr: Mor Yıldız Astrolojisi ve BaZi Analizi

source: Version
tr: Sürüm

source: Framework
tr: Çerçeve

source: Package
tr: Paket

source: Settings Saved
tr: Ayarlar Kaydedildi

# calculationPreferencesSaved
source: Calculation preferences saved successfully
tr: Hesaplama tercihleri başarıyla kaydedildi

source: Failed to save settings
tr: Ayarları kaydetme başarısız

source: Clear User Data
tr: Kullanıcı Verilerini Temizle

# clearUserDataDescription
source: This will delete all profiles, calculations, and analysis data. This action cannot be undone.
tr: Bu, tüm profilleri, hesaplamaları ve analiz verilerini silecektir. Bu işlem geri alınamaz.

source: Clear All
tr: Hepsini Temizle

source: Data Cleared
tr: Veri Temizlendi

# allUserDataCleared
source: All user data has been cleared
tr: Tüm kullanıcı verileri temizlendi

source: Failed to clear user data
tr: Kullanıcı verilerini temizleme başarısız

# exportDataTitle
source: Export Data
tr: Veri Dışa Aktarımı

source: Failed to export data
tr: Veri dışa aktarımı başarısız

source: Reset Settings
tr: Ayarları Sıfırla

# resetSettingsDescription
source: This will reset all settings to their default values.
tr: Bu, tüm ayarları varsayılan değerlerine sıfırlayacaktır.

source: Reset
tr: Sıfırla

source: Settings Reset
tr: Ayarlar Sıfırlandı

# allCalculationSettingsReset
source: All calculation settings have been reset to defaults
tr: Tüm hesaplama ayarları varsayılan değerlere sıfırlandı

# resetOnboardingTitle
source: Reset Onboarding
tr: Tanıtımı Sıfırla

# resetOnboardingDescription
source: This will reset the onboarding status. You will see the onboarding screens again on the next app launch.
tr: Bu, tanıtım durumunu sıfırlayacaktır. Bir sonraki uygulama başlatımında tanıtım ekranlarını tekrar göreceksiniz.

source: Onboarding Reset
tr: Tanıtım Sıfırlandı

# onboardingResetMessage
source: Onboarding has been reset. Restart the app to see it again.
tr: Tanıtım sıfırlandı. Tekrar görmek için uygulamayı yeniden başlatın.

# failedToResetOnboarding
source: Failed to reset onboarding: {error}
tr: Tanıtımı sıfırlama başarısız: {error}

source: Tarot
ja: タロット
zh: 塔罗

source: ASTRO MATCHER
ja: アストロマッチャー
zh: 占星配对

source: Metal
ja: 金
zh: 金

source: BaZi
ja: 八字
zh: 八字

# elementMetal
source: Metal
ja: 金

source: Element
ja: エレメント
